[
  {
    "ocdId": "ocd-division/country:us/district:dc",
    "registration": {
      "statusUrl": "https://apps.dcboe.org/vrs",
      "formUrl": "https://dcboe.org/voters/register-to-vote/register-update-voter-registration",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "electionDay",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.dcboe.org/Voters/Register-To-Vote/Register-to-Vote",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Federal law now requires that all voter registration applications must include either the applicant's DC-issued driver's license number or the last four digits of the applicant's Social Security number in order to be processed. If you have not been issued any of these numbers you must indicate \"None\".",
        "signatureInstructions": "To register in the District of Columbia you must: <br>be a United States citizen (required to vote in federal elections. If you are District of Columbia resident and not a US citizen, you can vote in DC local elections)<br>be a resident of the District of Columbia for at least 30 days prior to the election in which you intend to vote <br>not claim voting residence or the right to vote in another U.S. state, territory or country<br>be at least 17 years old (you may register to vote if you are at least 16 years old. You may vote in a primary election if you are at least 17 years old and you will be at least 18 years old by the next general election. You may vote in a general or special election if you are at least 18 years old.)<br>not have been found by a court to be legally incompetent to vote",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes:<br>A current and valid photo identification or<br>A current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register in DC, you must provide your DC DMV-issued identification number or if you do not have a DMV-issued identification number, the last four digits of your Social Security number. If you are registering to vote in the District of Columbia for the first time and submit a voter registration application electronically, you may be required to provide identification that shows your name and current address the first time you vote in an election. You may attach a copy of your document to the online form, or you may be required to show it the first time you vote in an election in the District of Columbia. Acceptable forms include: current and valid government-issued photo ID; current utility bill, cell phone bill, bank statement, government check, or paycheck dated no more than 90 days before submitting your application if a copy is submitted online or 90 days before voting if shown at a voting location; any other government-issued document.",
        "url": "https://vr.dcboe.org/213324797239968?agency_code=12"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://dcboe.org/Voters/Register-To-Vote/Register-to-Vote"
      },
      "parties": [
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "D.C. Statehood Green",
          "partyLabelEs": "Verde por la Estadidad de Washington D. C.",
          "partyPhrasingEn": "D.C. Statehood Green Party",
          "partyPhrasingEs": "Partido Verde por la Estadidad de Washington D. C."
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the District of Columbia online voter registration system, you are required to provide your District of Columbia Department of Motor Vehicles-issued ID number. If you do not have a DC DMV-issued ID, you must provide the last four digits of your Social Security Number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>If you are registering to vote in the District of Columbia for the first time and submit a voter registration application electronically, you may be required to provide identification that shows your name and current address the first time you vote in an election. You may attach a copy of your document to the online form, or you may be required to show it the first time you vote in an election in the District of Columbia. Acceptable forms include: current and valid government-issued photo ID; current utility bill, cell phone bill, bank statement, government check, or paycheck dated no more than 90 days before submitting your application if a copy is submitted online or 90 days before voting if shown at a voting location; any other government-issued document",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in the District of Columbia: District of Columbia Board of Elections office; any voter registration agency<br><br>If you are registering to vote in person, you are required to provide proof of residence that shows your name and current DC address.<br><br>Acceptable forms include: copy of a current and valid government-issued photo identification; utility bill for water, gas, electricity, cable, internet, telephone or cellular phone service issued no earlier than 90 days before the election in which you plan to vote; savings, checking, credit, or money market account statement from a bank or credit union issued no earlier than 90 days before the election in which you plan to vote; government-issued document or check from a federal or District agency, other than the Board of Elections, issued no earlier than 90 days before the election in which you plan to vote; current residential lease or rental agreement; occupancy statement from a District homeless shelter issued no earlier than 90 days before the election in which you plan to vote; tuition or housing bill from a District of Columbia college or university issued for the current academic or housing term",
      "byMailInstructions": "When submitting your application by mail in the District of Columbia, you are required to provide your District of Columbia Department of Motor Vehicles-issued ID number. If you do not have a DC DMV-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>If you are registering to vote in the District of Columbia for the first time, you may be required to provide identification that shows your name and current address the first time you vote in an election. Acceptable forms include: current and valid government-issued photo ID; current utility bill, cell phone bill, bank statement, government check, or paycheck dated no more than 90 days before submitting your application if a copy is submitted online or 90 days before voting if shown at a voting location; any other government-issued document",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ak",
    "registration": {
      "statusUrl": "https://myvoterportal.alaska.gov/",
      "formUrl": "https://www.elections.alaska.gov/doc/forms/C03.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.elections.alaska.gov/voter-information/#Reg",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When registering by mail in Alaska, you are required to provide ONE of the following ID numbers: Alaska driver’s license; Alaska state ID; last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, indicate that you do not have an ID number.<br><br>If you submit a voter registration application by mail and you are not already registered to vote in Alaska, you must provide proof of identity. You may include a copy of your proof of identity with your application, or you must verify your identity the first time you vote. Acceptable forms include: driver’s license; state ID card; US passport; current and valid photo identification; birth certificate; Hunting and Fishing license",
        "signatureInstructions": "To register in Alaska you must: <br>be a United States citizen <br>be at least 18 years old or will be within 90 days of completing your registration <br>be an Alaska resident <br>have not been convicted of a felony involving moral turpitude, unless your voting rights have been restore<br>not be registered to vote in another state unless you are willing to cancel your registration in that state",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Alaska, you need an Alaska driver's license or state ID and a Social Security number. The address on the ID needs to match the address where you're registering to vote. If you don't have an Alaska-issued ID, you can still register by mail.",
        "url": "https://voterregistration.alaska.gov/Registration/RegistrationDetails?haveValidAKDL=true"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.elections.alaska.gov/voter-information/#Reg"
      },
      "parties": [
        {
          "partyLabelEn": "American Solidarity",
          "partyLabelEs": "Solidaridad Estadounidense",
          "partyPhrasingEn": "American Solidarity Party",
          "partyPhrasingEs": "Partido de la Solidaridad Estadounidense"
        },
        {
          "partyLabelEn": "America",
          "partyLabelEs": "América",
          "partyPhrasingEn": "America Party",
          "partyPhrasingEs": " América"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Conservative",
          "partyLabelEs": "Conservador",
          "partyPhrasingEn": "Conservative Party",
          "partyPhrasingEs": "Partido Conservador"
        },
        {
          "partyLabelEn": "Prohibition",
          "partyLabelEs": "Prohibición",
          "partyPhrasingEn": "Prohibition Party",
          "partyPhrasingEs": "Partido de la  Prohibición"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Independence",
          "partyLabelEs": "Independencia",
          "partyPhrasingEn": "Independence Party",
          "partyPhrasingEs": "Partido de la Independencia"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Veterans",
          "partyLabelEs": "Veteranos",
          "partyPhrasingEn": "Veterans Party",
          "partyPhrasingEs": "Partido de los Veteranos"
        },
        {
          "partyLabelEn": "UCES' Clowns",
          "partyLabelEs": "UCES' Clowns",
          "partyPhrasingEn": "UCES' Clowns Party",
          "partyPhrasingEs": "Partido UCES' Clowns"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Reform Alaska Permanent Fund Dividend",
          "partyLabelEs": "Reforma del Dividendo del Fondo Permanente",
          "partyPhrasingEn": "Reform Alaska Permanent Fund Dividend Party",
          "partyPhrasingEs": "Partido por la Reforma del Dividendo del Fondo Permanente"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Alaska online voter registration system, you are required to provide your Social Security number and ONE of the following ID numbers: Alaska driver’s license; Alaska state ID<br>If you don’t have an Alaska-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Alaska: Division of Elections Offices; Division of Motor Vehicles (DMV) Offices; participating public libraries<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://www.elections.alaska.gov/Core/wheretoregister.php\">Alaska Division of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Alaska, you are required to provide ONE of the following ID numbers: Alaska driver’s license; Alaska state ID; last four digits of your Social Security number<br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br>If you submit a voter registration application by mail and you are not already registered to vote in Alaska, you must provide proof of identity. You may include a copy of your proof of identity with your application, or you must verify your identity the first time you vote. Acceptable forms include: driver’s license; state ID card; US passport; current and valid photo identification; birth certificate; Hunting and Fishing license",
      "eligibilityAge": "P17Y275D",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:al",
    "registration": {
      "statusUrl": "https://myinfo.alabamavotes.gov/voterview",
      "formUrl": "https://www.sos.alabama.gov/sites/default/files/voter-pdfs/nvra-2.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.alabama.gov/alabama-votes/voter/register-to-vote",
        "forms": "nvrf",
        "raceFieldRequired": ":required",
        "raceFieldInstructions": "You are required to fill in this box; however, your application will not be rejected if you fail to do so.",
        "idInstructions": "If you have one, you must provide your Alabama driver's license number or Alabama non-driver's identification card number. If you do not have an Alabama driver's license or non-driver's identification card, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers you must indicate \"NONE\" and a unique identifier will be provided for you.",
        "signatureInstructions": "To register in Alabama you must: <br>be a United States citizen<br>be a resident of Alabama and your county at the time of registration<br>be 18 years old on or before Election Day<br>have not been convicted of a disqualifying felony (or have had rights restored). You can find the list of disqualifying felonies on the Secretary of State’s website at <a href=\"http://www.sos.alabama.gov/mtfelonies\" target=\"_blank\">sos.alabama.gov/mtfelonies</a><br>have not been legally declared \"mentally incompetent\" by a court<br>swear or affirm to \"support and defend the Constitution of the U.S. and the State of Alabama and further disavow any belief or affiliation with any group which advocates the overthrow of the governments of the U.S. or the State of Alabama by unlawful means and that the information contained herein is true\"",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Alabama, you need an Alabama Driver's License or an Alabama Non-Driver's Identification card. If you don’t have an Alabama-issued ID, you can still register by mail.",
        "url": "https://www.alabamainteractive.org/sos/voter_registration/instructions.action"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.alabama.gov/alabama-votes/voter-registration/general-info"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Alabama online voter registration system, you are required to provide ONE of the following valid ID numbers: Alabama Driver's License; Alabama Non-Driver's Identification card<br><br>If you don’t have an Alabama-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your local County Board of Registrars in Alabama. <br><br>You can also obtain a voter registration application in person at any of the following public agencies in Alabama: driver's licensing office; county and select municipal public libraries; public four-year universities and select private four-year universities<br><br>You can find a list of locations that provide voter registration services and voter registration application on the <a href=\"https://www.sos.alabama.gov/alabama-votes/voter-registration/general-info\">Alabama Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Alabama, you are required to provide your Alabama Driver’s License number or Alabama Non-Driver ID number. If you do not have one, you are required to provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. You may send with your application a copy of your valid photo ID.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-05-19",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ar",
    "registration": {
      "statusUrl": "https://www.voterview.ar-nova.org/voterview",
      "formUrl": "https://www.sos.arkansas.gov/uploads/elections/Voter_Reg_App._8-2023_.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.arkansas.gov/elections/voter-information/voter-registration-information",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Your completed voter registration form must contain your Arkansas driver's license number or nonoperating identification number. If you do not have a driver's license or nonoperating identification, you must include the last four digits of your Social Security number. If you do not have a driver's license or a nonoperating identification or a Social Security number, please indicate \"NONE\" on the form. A unique identifying number will be assigned by the State.",
        "signatureInstructions": "To register in Arkansas you must: <br>be a United States citizen<br>live in Arkansas at the address on your voter registration application <br>turn 18 on or before the next election <br>not be a convicted felon (or have completely discharged your sentence or been pardoned) <br>not claim the right to vote in any other jurisdiction <br>not presently be adjudged mentally incompetent by a court of competent jurisdiction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are submitting a voter registration application by mail, are registering for the first time in your jurisdiction, and you do not have a valid Arkansas driver’s license number or Social Security number, you must submit with the mailed registration form: <br><br>current and valid photo identification<br>or a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address. <br>If you do not submit an approved form of identification with your application, you must provide one when you vote for the first time.<br>More information <a href=\"https://www.sos.arkansas.gov/elections/voter-information/voter-registration-information/\">here</a>."
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.arkansas.gov/elections/voter-information/voter-registration-information"
      },
      "parties": [
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can obtain a voter registration application in person at any of the following public agencies in Arkansas: local county clerk; revenue or DMV office; public library<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://www.sos.arkansas.gov/elections/voter-information/voter-registration-information\">Arkansas Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting a registration application by mail in Arkansas, you are required to provide your Arkansas driver’s license number. If you have not been issued an Arkansas driver’s license number, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>If you are registering to vote for the first time and you do not include an ID number on your mail-in application, you must submit with your form a copy of ONE of the following forms of ID: current and valid photo identification; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address<br><br>If you do not include a copy of your ID, you will be required to provide additional identification when voting for the first time.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-03-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:az",
    "registration": {
      "statusUrl": "https://my.arizona.vote/WhereToVote.aspx?s=individual",
      "formUrl": "https://azsos.gov/sites/default/files/docs/AZ-State-Voter-Registration-Form-Dec2025-fillable.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://azsos.gov/elections/voters#registertovote",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Your completed voter registration form must contain the number of your Arizona driver's license, or non-operating identification license issued pursuant to A.R.S. Sec. 28-3165, if the license is current and valid. If you do not have a current and valid Arizona driver's license or non-operating identification license, you must include the last four digits of your Social Security number if one has been issued to you. If you do not have a current and valid driver's license or non-operating identification license or a Social Security number, please write \"NONE\" on the form. A unique identifying number will be assigned by the Secretary of State.",
        "signatureInstructions": "To register in Arizona you must: <br>be a United States citizen (proof of citizenship required to vote \"full ballot\")<br>be a resident of Arizona and the county listed on your registration<br>be 18 years old on or before the next general election <br>not have been convicted of treason or a felony (or have had your civil rights restored) <br>not currently be declared an incapacitated person by a court of law with your voting rights revoked<br>be able to write your name or make your mark (unless prevented by disability)",
        "citizenInstructions": "If this is your first time registering to vote in Arizona, your voter registration form also must include proof of citizenship or you may be registered as a federal-only voter. To be eligible to vote a “full ballot,” you must submit proof of citizenship with your registration form. A “full ballot” includes all federal, state, county, and local races and ballot questions for which you are eligible to vote. If you have an Arizona driver's license or non-operating identification issued after October 1, 1996, write the number on the form. This will serve as proof of citizenship and no additional documents are needed. If not, you should attach proof of citizenship to the form. Please include a copy of one of the following documents: birth certificate and supporting legal documentation (i.e. marriage certificate) if the name on the birth certificate is not the same as your current legal name; passport; naturalization documents or ID number; Bureau of Indian Affairs (BIA) card number, tribal treaty card number, or tribal enrollment number; or Tribal Certificate of Indian Blood or Tribal or BIA Affidavit of Birth. Do not send original documents. Photocopies will not be returned to you.",
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing a registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification for voter registration includes: a current and valid photo identification or a current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "You need an Arizona driver's license or non-operating ID to use Arizona's online voter registration system. If you don't have an Arizona-issued ID, you can still register by mail to vote.",
        "url": "https://azmvdnow.gov/guest/customeranonymous/voterregistration"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://azsos.gov/elections/voters#registertovote"
      },
      "parties": [
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Independent",
          "partyLabelEs": "Independiente",
          "partyPhrasingEn": "Independent Party",
          "partyPhrasingEs": "Partido Independiente"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Arizona online voter registration system, you are required to provide ONE of the following ID numbers issued by the Motor Vehicle Division (MVD): Arizona Driver License; Arizona non-operating ID<br><br>If you don’t have an Arizona MVD-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your County Recorder’s office in Arizona.",
      "byMailInstructions": "When submitting your application by mail in Arizona, you are required to provide ONE of the following ID numbers: Arizona Driver License; ;Arizona non-operating ID; last four digits of Social Security number; tribal ID; alien registration, naturalization certificate, or citizenship certificate<br><br>You must submit proof of citizenship with your registration form to vote a full ballot that includes all federal, state, county, and local races and ballot questions for which you are eligible. Your Arizona driver’s license number will serve as proof of citizenship if it was issued after October 1, 1996, AND it was issued after you became a US citizen. You can find a full list of forms of proof of citizenship on the <a href=\"https://azsos.gov/elections/voters#regreq\">Arizona Secretary of State’s</a> website.<br><br>If you do not provide proof of citizenship or proof of citizenship cannot be acquired from the Arizona Motor Vehicle Division, your ballot will only include federal races.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next regular general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ca",
    "registration": {
      "statusUrl": "https://voterstatus.sos.ca.gov/",
      "formUrl": "https://www.sos.ca.gov/elections/voter-registration/",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.ca.gov/elections/voter-registration",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When you register to vote, you must provide your California driver's license or California identification card number, if you have one. If you do not have a driver's license or ID card, you must provide the last four digits of your Social Security number (SSN). If you do not include this information, you will be required to provide identification when you vote if it is your first time voting in a federal election.",
        "signatureInstructions": "To register in California you must:<br>be a United States citizen<br>be a California resident<br>be at least 18 years old or older on Election Day <br>not be currently serving a state or federal prison term for the conviction of a felony<br>not be currently found to be mentally incompetent to vote by a court",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes a current and valid photo identification or a current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in California, you need to provide a California-issued driver license or California identification card number, the last four digits of your Social Security number, and consent to the use of your DMV-stored digital signature to use California’s online voter registration system. If you don't have a California-issued ID or don't want to provide consent for the use of your digital signature, you can use the California Online Voter Registration system to fill out an application. You must then print the form or request that your local election office print and mail the form to you. The printed form must be completed and returned to your local election office by mail or in person.",
        "url": "https://registertovote.ca.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.ca.gov/elections/voter-registration"
      },
      "parties": [
        {
          "partyLabelEn": "Peace and Freedom",
          "partyLabelEs": "Paz y Libertad",
          "partyPhrasingEn": "Peace and Freedom Party",
          "partyPhrasingEs": "Partido Paz y Libertad"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "American Independent",
          "partyLabelEs": "Independiente Americano",
          "partyPhrasingEn": "American Independent Party",
          "partyPhrasingEs": "Partido Independiente Americano"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        }
      ]
    },
    "youthRegistration": {
      "url": "https://www.sos.ca.gov/elections/pre-register-16-vote-18/pre-reg-faqs",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the California online voter registration system, you are required to provide: California-issued driver license or California identification card number; last four digits of your Social Security number; consent to the use of your DMV-stored digital signature to use California’s online voter registration system<br><br>If you don't have a California-issued ID or don't want to provide consent for the use of your digital signature, you can use the California Online Voter Registration system to fill out an application. You must then print the form or request that your local election office print and mail the form to you. The printed form must be completed and returned to your local election office by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any California Department of Motor Vehicles (DMV) office while applying for a driver license or identification card or changing your address with the DMV. <br><br>You can also pick up a voter registration application, fill out the form completely, and return it at your county elections office. You can find a list of locations that provide voter registration applications on the <a href=\"https://www.sos.ca.gov/elections/pre-register-16-vote-18/pre-reg-faqs\">California Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in California, you are required to provide your date of birth and U.S. state or foreign country of birth and the following if you have them: California-issued driver license or California identification card number; last four digits of your Social Security number",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:co",
    "registration": {
      "statusUrl": "https://www.coloradosos.gov/voter/pages/pub/olvr/findVoterReg.xhtml",
      "formUrl": "https://www.coloradosos.gov/pubs/elections/vote/VoterRegFormEnglish.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.coloradosos.gov/pubs/elections/FAQs/VoterRegistrationFAQ.html",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Colorado, you are required to provide your Colorado driver’s license number or Colorado ID card number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate NONE.",
        "signatureInstructions": "To register in Colorado you must: <br>be a United States citizen<br>be a Colorado resident for at least 22 days immediately before the election in which you intend to vote, UNLESS that election is a presidential general election. In this case, you may be a resident for less than 22 days and cast a provisional ballot in person for president and vice president candidates ONLY<br>be at least 15 years old, and you must be at least 18 on or before Election Day to be eligible to vote<br>not be serving a sentence of detention or confinement for a felony conviction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Colorado, you need to provide at least ONE of the following: Colorado Driver’s License number, Colorado ID card number, OR the last four digits of your Social Security number. If you don’t have a Colorado Driver’s License, Colorado ID card, or Social Security number, you can still submit a voter registration application by mail.",
        "url": "https://www.coloradosos.gov/voter/pages/pub/olvr/verifyNewVoter.xhtml"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.coloradosos.gov/pubs/elections/FAQs/VoterRegistrationFAQ.html"
      },
      "parties": [
        {
          "partyLabelEn": "No Labels",
          "partyLabelEs": "Sin Etiquetas",
          "partyPhrasingEn": "No Labels Party",
          "partyPhrasingEs": "Partido Sin Etiquetas"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Unity",
          "partyLabelEs": "Unidad",
          "partyPhrasingEn": "Unity Party",
          "partyPhrasingEs": "Partido de la Unidad"
        },
        {
          "partyLabelEn": "American Constitution",
          "partyLabelEs": "Constitución Estadounidense",
          "partyPhrasingEn": "American Constitution Party",
          "partyPhrasingEs": "Partido de la Constitución Estadounidense"
        },
        {
          "partyLabelEn": "Center",
          "partyLabelEs": "Centro",
          "partyPhrasingEn": "Center Party",
          "partyPhrasingEs": "Partido del  Centro"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Forward",
          "partyLabelEs": "Forward",
          "partyPhrasingEn": "Forward Party",
          "partyPhrasingEs": "Partido Forward"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": " Libertario"
        },
        {
          "partyLabelEn": "Approval Voting",
          "partyLabelEs": "Voto por Aprobación",
          "partyPhrasingEn": "Approval Voting Party",
          "partyPhrasingEs": "Partido de  Voto por Aprobación"
        }
      ]
    },
    "youthRegistration": {
      "url": "https://www.sos.state.co.us/pubs/elections/highSchoolRegistration.html",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Colorado online voter registration system, you are required to provide at least ONE of the following: Colorado driver’s license number; Colorado ID card number; last four digits of your Social Security number<br><br>If you don’t have a Colorado Driver’s License, Colorado ID card, or Social Security number, you can still submit a voter registration application in person or by mail.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Colorado: Colorado Department of Motor Vehicle office when you apply for a driver's license or when updating your driver's license information; Colorado public high schools; county clerk and recorder’s office<br><br>You can also complete a voter registration application in person at any office that provides voter registration services and applications. You can find a full list on the <a href=\"https://www.coloradosos.gov/pubs/elections/FAQs/VoterRegistrationFAQ.html\">Colorado Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Colorado, you are required to provide your Colorado driver’s license number or Colorado ID card number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, indicate NONE. You may be required to provide an acceptable form of ID the first time you vote in an election in Colorado. You can find a full list of acceptable forms of ID on the <a href=\"https://www.coloradosos.gov/pubs/elections/vote/acceptableFormsOfID.html\">Colorado Secretary of State</a> website.",
      "eligibilityAge": "P15Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ct",
    "registration": {
      "statusUrl": "https://portaldir.ct.gov/sots/LookUp.aspx",
      "formUrl": "https://portal.ct.gov/-/media/sots/electionservices/2024/ed-671-non-coded-english-5-24.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://portal.ct.gov/SOTS/Election-Services/Register-to-Vote/Voter-Registration-Application-English-and-Spanish",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When you register to vote, you must provide your Connecticut driver's license number, or if none, the last four digits of your Social Security number.",
        "signatureInstructions": "To register in Connecticut you must: <br>be a United States citizen<br>be a resident of Connecticut and of the town in which you wish to vote <br>be at least 17 years old and be at least 18 years old on or before Election Day (17 year-olds who will turn 18 on or before Election Day may participate in the general primary)<br>have completed confinement if previously convicted of a felony, and have had your voting rights restored by Registrars of Voters",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or<br>current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To use the online voter registration system you must have a current and valid driver’s license, learner’s permit, or non-driver photo identification card issued by the Connecticut Department of Motor Vehicles (DMV) and a signature on file with DMV.",
        "url": "https://voterregistration.ct.gov/OLVR/welcome.do"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://portal.ct.gov/SOTS/Election-Services/Voter-Information/Voter-Registration-Information"
      },
      "parties": [
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Independent",
          "partyLabelEs": "Independiente",
          "partyPhrasingEn": "Independent Party",
          "partyPhrasingEs": "Partido Independiente"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Working Families",
          "partyLabelEs": "Familias Trabajadoras",
          "partyPhrasingEn": "Working Families Party",
          "partyPhrasingEs": "Partido de las Familias Trabajadoras"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Connecticut online voter registration system, you are required to provide a current and valid ID number issued by the Connecticut Department of Motor Vehicles (DMV). Acceptable ID numbers include: Connecticut driver’s license; Connecticut learner’s permit; Connecticut non-driver photo ID<br><br>If you don’t have a CT DMV-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Connecticut: town clerk; town registrar; Connecticut Department of Motor Vehicles (when receiving driver’s license, learner’s permit, or non-driver identification card service)",
      "byMailInstructions": "When submitting a registration application by mail in Connecticut, you are required to provide your Connecticut driver’s license number. If you have not been issued a Connecticut driver’s license number, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, leave that field blank. <br><br>If it is your first time registering, you are submitting your application by mail, and you do not include an ID number, you may wish to submit a copy of one form of identification so that you avoid additional ID requirements when you vote for the first time. Acceptable forms include: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or government document that shows your name and address",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next regular election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:de",
    "registration": {
      "statusUrl": "https://ivote.de.gov/voterview",
      "formUrl": "https://elections.delaware.gov/voter/pdfs/VoterRegApplication.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://elections.delaware.gov/voter/votereg.shtml#how",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Delaware, you are required to provide your Delaware driver’s license number or Delaware State ID number. If you do not have a Delaware-issued ID, you are required to provide the last four digits of your Social Security number.",
        "signatureInstructions": "You may register to vote in Delaware if you:<br>are a United States citizen<br>are a Delaware resident (Delaware is your home)<br>will be 18 years old on or before the date of the next general election<br>have NOT been adjudged mentally incompetent (adjudged mentally incompetent refers to a specific finding in a judicial guardianship or equivalent proceeding, based on clear and convincing evidence that the individual has a severe cognitive impairment which precludes exercise of basic voting judgment)<br>have NOT been convicted of a felony, unless you have completed your sentence<br>have NOT been convicted of a disqualifying felony, or you have been convicted of a disqualifying felony and you have been pardoned<br><br>List of disqualifying felonies include: murder or manslaughter (except vehicular homicide); any felony constituting an offense against public administration involving bribery or improper influence or abuse of office, or any like offense under the laws of any state or local jurisdiction, or of the United States, or of the District of Columbia; or any felony constituting a sexual offense, or any like offense under the laws of any state or local jurisdiction or of the United States or of the District of Columbia",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in Delaware and are mailing a registration application, you must submit proof of identification with your application. If you do not provide required identification documentation, you must provide it the first time you vote in a federal election. Proof of identification includes: copy of a current and valid photo identification; copy of a current utility bill, bank statement, government check, paycheck; or other government document that shows your name and address <br>More information <a href=\"https://elections.delaware.gov/voter/votereg.shtml\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Delaware, you must be at least 18 years old on or before the next general election. You must provide ONE of the following when registering online: Delaware driver's license number, Delaware State ID number, or the last four digits of your Social Security number.",
        "url": "https://ivote.de.gov/voterview/registrant/newregistrant"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://elections.delaware.gov/voter/votereg.shtml#how"
      },
      "parties": [
        {
          "partyLabelEn": "American",
          "partyLabelEs": "Americano",
          "partyPhrasingEn": "American Party",
          "partyPhrasingEs": "Partido Americano"
        },
        {
          "partyLabelEn": "Working Families",
          "partyLabelEs": "Familias Trabajadoras",
          "partyPhrasingEn": "Working Families Party",
          "partyPhrasingEs": "Partido de las Familias Trabajadoras"
        },
        {
          "partyLabelEn": "We The People",
          "partyLabelEs": "Nosotros, el Pueblo",
          "partyPhrasingEn": "We The People Party",
          "partyPhrasingEs": "Partido Nosotros, el Pueblo"
        },
        {
          "partyLabelEn": "Socialist Workers",
          "partyLabelEs": "Socialista de los Trabajadores",
          "partyPhrasingEn": "Socialist Workers Party",
          "partyPhrasingEs": "Partido Socialista de los Trabajadores"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Reform",
          "partyLabelEs": "Reformista",
          "partyPhrasingEn": "Reform Party",
          "partyPhrasingEs": "Partido Reformista"
        },
        {
          "partyLabelEn": "Nonpartisan",
          "partyLabelEs": "No Partidista",
          "partyPhrasingEn": "Nonpartisan Party",
          "partyPhrasingEs": "Partido No Partidista"
        },
        {
          "partyLabelEn": "No Labels",
          "partyLabelEs": "Sin Etiquetas",
          "partyPhrasingEn": "No Labels Party",
          "partyPhrasingEs": "Partido Sin Etiquetas"
        },
        {
          "partyLabelEn": "Natural Law",
          "partyLabelEs": "Ley Natural",
          "partyPhrasingEn": "Natural Law Party",
          "partyPhrasingEs": "Partido de la  Ley Natural"
        },
        {
          "partyLabelEn": "Mandalorians",
          "partyLabelEs": "Mandalorians",
          "partyPhrasingEn": "Mandalorians Party",
          "partyPhrasingEs": "Partido de los Mandalorians"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Liberal",
          "partyLabelEs": "Liberal",
          "partyPhrasingEn": "Liberal Party",
          "partyPhrasingEs": "Partido Liberal"
        },
        {
          "partyLabelEn": "Independent",
          "partyLabelEs": "Independiente",
          "partyPhrasingEn": "Independent Party",
          "partyPhrasingEs": "Partido Independiente"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Conservative",
          "partyLabelEs": "Conservador",
          "partyPhrasingEn": "Conservative Party",
          "partyPhrasingEs": "Partido Conservador"
        },
        {
          "partyLabelEn": "Blue Enigma",
          "partyLabelEs": "Blue Enigma",
          "partyPhrasingEn": "Blue Enigma Party",
          "partyPhrasingEs": "Partido Blue Enigma"
        },
        {
          "partyLabelEn": "American Delta",
          "partyLabelEs": "Delta Americano",
          "partyPhrasingEn": "American Delta Party",
          "partyPhrasingEs": "Partido Delta Americano"
        }
      ]
    },
    "youthRegistration": {
      "url": "https://dmv.de.gov/DriverServices/other/index.shtml?dc=dr_oth_vote",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register online in Delaware, you must be at least 18 years old on or before the next general election.<br><br>You are required to provide ONE of the following when registering online: Delaware driver's license number; Delaware State ID number; last four digits of your Social Security number",
      "inPersonInstructions": "You can complete a voter registration application in person if you are at least 16 years old. You can register at the Division of Motor Vehicles (DMV) when obtaining a driver’s license.",
      "byMailInstructions": "You must be at least 18 years old on or before the next general election to submit a voter registration application by mail in Delaware.<br><br>When submitting your application by mail in Delaware, you are required to provide your Delaware driver’s license number or Delaware State ID number. If you do not have a Delaware-issued ID, you are required to provide the last four digits of your Social Security number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:fl",
    "registration": {
      "statusUrl": "https://registration.dos.fl.gov/CheckVoterStatus",
      "formUrl": "https://files.floridados.gov/media/704789/1s-2040-form-ds-de-39-eng-fillable-20251017.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://dos.fl.gov/elections/for-voters/voter-registration/register-to-vote-or-update-your-information/",
        "forms": "nvrf",
        "raceFieldRequired": ":requested",
        "raceFieldInstructions": "You are requested, but not required, to fill in this box.",
        "idInstructions": "If you have one, you must provide your Florida driver's license number or Florida identification card number. If you do not have a Florida driver's license or identification card, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate NONE.",
        "signatureInstructions": "To register in Florida, you must:<br>be a citizen of the United States (a lawful permanent resident, commonly referred to as a \"green card holder,\" does not have the right to register or vote in Florida)<br>be a legal resident of Florida and of the county in which you want to register<br>be at least 18 years old (you may pre-register to vote if you are at least 16 years old)<br>not be adjudicated mentally incapacitated with respect to voting in Florida or any other state without having the right to vote restored<br>not have been convicted of a felony without your voting rights having been restored",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.leg.state.fl.us/Statutes/index.cfm?App_mode=Display_Statute&amp;Search_String=&amp;URL=0000-0099/0097/Sections/0097.0535.html\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Florida, you are required to provide the last four digits of your Social Security number and the issued date and ID number from your Florida driver license or Florida identification card issued by the Florida Department of Highway Safety and Motor Vehicles. If you don’t have a Florida-issued ID or Social Security number, you can still submit a voter registration application by mail or in person.",
        "url": "https://registertovoteflorida.gov/home"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://dos.fl.gov/elections/for-voters/voter-registration/national-voter-registration-act/"
      },
      "parties": [
        {
          "partyLabelEn": "Boricua",
          "partyLabelEs": "Boricua",
          "partyPhrasingEn": "Boricua Party",
          "partyPhrasingEs": "Partido Boricua"
        },
        {
          "partyLabelEn": "American Solidarity",
          "partyLabelEs": "Solidaridad Americana",
          "partyPhrasingEn": "American Solidarity Party",
          "partyPhrasingEs": "Partido de la  Solidaridad Americana"
        },
        {
          "partyLabelEn": "America First",
          "partyLabelEs": "Primero América",
          "partyPhrasingEn": "America First Party",
          "partyPhrasingEs": "Partido Primero América"
        },
        {
          "partyLabelEn": "Socialism and Liberation",
          "partyLabelEs": "Socialismo y la Liberación",
          "partyPhrasingEn": "Socialism and Liberation Party",
          "partyPhrasingEs": "Partido por el  Socialismo y la Liberación"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Reform",
          "partyLabelEs": "Reformista",
          "partyPhrasingEn": "Reform Party",
          "partyPhrasingEs": "Partido Reformista"
        },
        {
          "partyLabelEn": "MGTOW",
          "partyLabelEs": "MGTOW",
          "partyPhrasingEn": "MGTOW Party",
          "partyPhrasingEs": "Partido MGTOW"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Jeffersonian",
          "partyLabelEs": "Jeffersoniano",
          "partyPhrasingEn": "Jeffersonian Party",
          "partyPhrasingEs": "Partido Jeffersoniano"
        },
        {
          "partyLabelEn": "Independent",
          "partyLabelEs": "Independiente",
          "partyPhrasingEn": "Independent Party",
          "partyPhrasingEs": "Partido Independiente"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Forward",
          "partyLabelEs": "Florida Forward",
          "partyPhrasingEn": "Forward Party",
          "partyPhrasingEs": "Partido Florida Forward"
        },
        {
          "partyLabelEn": "Ecology",
          "partyLabelEs": "Ecologista",
          "partyPhrasingEn": "Ecology Party",
          "partyPhrasingEs": "Partido Ecologista"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Conservative",
          "partyLabelEs": "Conservador",
          "partyPhrasingEn": "Conservative Party",
          "partyPhrasingEs": "Partido Conservador"
        },
        {
          "partyLabelEn": "Coalition With A Purpose",
          "partyLabelEs": "Coalición con un Propósito",
          "partyPhrasingEn": "Coalition With A Purpose Party",
          "partyPhrasingEs": "Partido de la  Coalición con un Propósito"
        }
      ]
    },
    "youthRegistration": {
      "url": "https://registertovoteflorida.gov/home",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Florida online voter registration system, you are required to provide the last four digits of your Social Security number and the issued date and ID number from ONE of the following: Florida driver license; Florida identification card issued by the Florida Department of Highway Safety and Motor Vehicles<br><br>If you don’t have any of the above, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Florida: Florida driver license office; public libraries; any office that provides public assistance<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://dos.fl.gov/elections/for-voters/voter-registration/national-voter-registration-act/\">Florida Division of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Florida, you are required to provide your current and valid Florida driver’s license number or Florida identification card number, if you have one. If you do not have a Florida driver’s license or state ID, you are required to include the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: ID that shows your name and photo (includes US passport, debit or credit card, and student ID); ID that shows your name and current residence address (includes bank statement, government check, paycheck, or other government document) <br><br>You can find a full list of acceptable forms of ID on the <a href=\"https://files.floridados.gov/media/704789/1s-2040-form-ds-de-39-eng-fillable-20250805.pdf\">Florida statewide voter registration application</a>.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ga",
    "registration": {
      "statusUrl": "https://mvp.sos.ga.gov/s/",
      "formUrl": "https://sos.ga.gov/sites/default/files/forms/GA_VR_APP_2019.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://georgia.gov/register-vote",
        "forms": "gaReg",
        "raceFieldRequired": ":requested",
        "raceFieldInstructions": "You are requested, but not required, to fill in this box.",
        "idInstructions": "Federal law requires you to provide your full Georgia driver's license number or Georgia-issued ID number. If you do not have a Georgia driver's license or Georgia ID, you must provide the last 4 digits of your Social Security number. Providing your full Social Security number is optional. Your Social Security number will be kept confidential and may be used for comparison with other state agency databases for voter registration identification purposes. If you do not possess a Georgia driver's license or Social Security number, a unique identifier will be provided for you.",
        "signatureInstructions": "To register in Georgia you must: <br>be a United States citizen <br>be a legal resident of Georgia and of the county in which you want to vote <br>be at least 17.5 years old (you must be 18 to vote)<br>not be serving a sentence for conviction of a felony involving moral turpitude<br>not have been judicially determined to be mentally incompetent, unless the disability has been removed",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://sos.ga.gov/sites/default/files/forms/GA_VR_APP_2019.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Georgia, you are required to provide your valid Georgia driver’s license number or your ID card number issued by the Georgia Department of Driver Services (DDS). If you don’t have a Georgia driver’s license or ID card issued by DDS, you can still submit a voter registration application by mail or in person.",
        "url": "https://mvp.sos.ga.gov/s/voter-registration?IsRegisterNow=true"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://georgia.gov/register-vote"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Georgia online voter registration system, you are required to provide an identification (ID) number from ONE of the following: valid Georgia driver’s license; ID card issued by the Georgia Department of Driver Services (DDS)<br><br>If you don’t have a Georgia driver’s license or ID card issued by DDS, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any Georgia Department of Driver Services (DDS) office while applying for a driver license or identification card or changing your address with the DDS. <br><br>You can obtain a voter registration application in person at any of the following public agencies in Georgia: Department of Driver Services office when applying for or renewing your driver’s license or ID card; county board of registrars or election office; public library<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://sos.ga.gov/how-to-guide/how-guide-registering-vote\">Georgia Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Georgia, you are required to provide ONE of the following: Georgia driver’s license number; Georgia state-issued ID number; last four digits of your Social Security number<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>You are also required to provide a copy of proof of residence if you are registering for the first time and submitting your application by mail. Acceptable forms of proof of residence include: current and valid photo ID; utility bill, bank statement, government check, paycheck, or other government document that shows your name and address",
      "eligibilityAge": "P17Y6M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:hi",
    "registration": {
      "statusUrl": "https://olvr.hawaii.gov/",
      "formUrl": "https://elections.hawaii.gov/wp-content/uploads/1436986-01-Hawaii-Votes_application_final.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://elections.hawaii.gov/register-to-vote/registration/",
        "forms": "nvrf",
        "raceFieldRequired": ":optional",
        "raceFieldInstructions": "Race or ethnic group information is not required for voter registration.",
        "idInstructions": "When you register to vote, you must provide your Hawaii driver’s license or State identification number, if you have one. If you do not have a driver’s license or ID number, you must provide the last four digits of your Social Security number (SSN). If you do not have any of this information, the Clerk’s Office will issue you a unique identification number, which will serve to identify you for voter registration purposes.",
        "signatureInstructions": "To register in Hawaii you must: <br>be a United States citizen<br>be a State of Hawaii resident<br>be at least 16 years old (you must be 18 years old by election day in order to vote) <br>not be incarcerated for a felony conviction <br>not be adjudicated by a court as \"non compos mentis\"",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes:<br>A current and valid photo identification or<br>A current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "You need a Hawaii ID and a Social Security number to use Hawaii's online voter registration system. If you don’t have a Social Security number or a Hawaii-issued ID, you can still submit a voter registration application by mail or in person.",
        "url": "https://olvr.hawaii.gov/register.aspx"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://elections.hawaii.gov/register-to-vote/registration/"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Hawaii online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following: Hawaii Driver License number; Hawaii State ID card number<br><br>If you don’t have a Social Security number or a Hawaii-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can apply to register to vote in Hawaii at the Department of Motor Vehicles when you complete a driver license or State ID application. You can also complete a voter registration application in person at any of the following public agencies in Hawaii: Hawaii Office of Elections; County Elections Divisions; State Libraries<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://elections.hawaii.gov/register-to-vote/registration/\">Hawaii Office of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Hawaii, you are required to provide your Hawaii Driver License number or Hawaii state identification (ID) number, if you have one. <br><br>If you do not have a Hawaii Driver License or State ID, you are required to include the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ia",
    "registration": {
      "statusUrl": "https://apps.sos.iowa.gov/elections/voterreg/regtovote/search.aspx",
      "formUrl": "https://sos.iowa.gov/elections/pdf/voteapp.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://voterready.iowa.gov/registertovote/#vote-mail-heading",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Iowa, you are required to provide ONE of the following: Iowa driver’s license number, Iowa non-operators ID number, or last four digits of your Social Security number. If you have not been issued any of these numbers, indicate you do not have an ID number.",
        "signatureInstructions": "To register in Iowa you must: <br>be a United States citizen<br>be an Iowa resident<br>be at least 17 years old (you may register to vote if you are at least 17 years old. You may vote if you will be 18 years old on or before Election Day. You may vote in a primary election if you are at least 17 years old and you will be at least 18 years old by the corresponding regular election.)<br>not have been convicted of a felony (unless your voting rights have been restored)<br>not currently be judged by a court to be \"incompetent to vote\"<br>not claim the right to vote in more than one place",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Iowa, you need the last FIVE digits of your Social Security number and either an Iowa Driver’s License or an Iowa Non-operators ID. If you have not been issued a Social Security number or Iowa ID number, you can still submit a voter registration application by mail.",
        "url": "https://mymvd.iowadot.gov/Account/Login?ReturnUrl=%2fVoterRegistration"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://voterready.iowa.gov/registertovote/#vote-county-auditor"
      },
      "parties": [
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Iowa online voter registration system, you are required to provide to last five digits of your Social Security number and ONE of the following ID numbers: Iowa driver’s license; Iowa non-operators ID<br><br>If you have not been issued a Social Security number or Iowa ID number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county auditor’s office in Iowa. <br><br>If you are submitting a voter registration application in person, you are required to provide ONE of the following: Iowa driver’s license number; Iowa non-operators ID number; Last four digits of your Social Security number<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "byMailInstructions": "When submitting your application by mail in Iowa, you are required to provide ONE of the following: Iowa driver’s license number; Iowa non-operators ID number; last four digits of your Social Security number<br><br>If you have not been issued any of these numbers, indicate you do not have an ID number.<br><br>You must sign the form before returning it to your county auditor. If you are not physically able to sign the form, you may use a rubber stamp or mark that you use regularly, or you may ask someone to sign your name as long as the person is with you when signing the form at your request.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:id",
    "registration": {
      "statusUrl": "https://elections.sos.idaho.gov/ElectionLink/ElectionLink/VoterSearch.aspx",
      "formUrl": "https://sos.idaho.gov/elections/forms/voter_registration.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://voteidaho.gov/voter-registration/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When registering by mail in Idaho, you need an Idaho Driver’s License number or the last four digits of your Social Security number. If you registered to vote on or after July 1, 2023, and you do not have an Idaho-issued ID or your residence does not match the address on your ID, you must provide proof of residence to your county elections office or at the polls. Proof of residency documents must be current and include the address you wish to use when registering. Acceptable forms can include (but are not limited to) an Idaho Driver’s License or Idaho ID card, US federal photo ID, Tribal ID card, Concealed Weapons License issued by an Idaho county sheriff, proof of insurance, mortgage, or rental agreement, utility bill (excluding cell phone bills), bank or credit card statement, paystub, paycheck, or government-issue check.",
        "signatureInstructions": "To register in Idaho you must: <br>be a United States citizen<br>have resided in Idaho and in the county for 30 days prior to the day of election <br>be at least 18 years old <br>not have been convicted of a felony, and without having been restored to the rights of citizenship, or confined in prison on conviction of a criminal offense",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering for the first time in your jurisdiction and are mailing this registration application, you must show an approved form of photo ID as proof of identification when you vote. You may also need to provide an approved form of proof of residence the first time you vote if you did not include it with your registration application. Proof of residency documentation must include the current name and address you use to register to vote. Acceptable forms include but are not limited to: Idaho driver’s license, Idaho ID card, US passport or federal ID, tribal ID card, or concealed weapons license issued by a county sheriff in Idaho. Visit the Idaho Secretary of State website for more information about proof of identity and proof of residence: https://tvote.org/idaho_id"
      },
      "online": {
        "supported": true,
        "instructions": "You need an Idaho ID to use Idaho's online voter registration system. If your residence does not match the address on your ID, you are required to provide proof of residence. Acceptable forms include (but are not limited to): proof of insurance; mortgage, lease, or rental agreement; utility bill (excluding cell phone); bank or credit card statement; paystub or paycheck; and enrollment letter from an Idaho high school or university. If you don’t have an Idaho DMV-issued ID, you can still submit a voter registration application by mail or in person.",
        "url": "https://elections.sos.idaho.gov/ElectionLink/ElectionLink/ApplicationInstructions.aspx"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://voteidaho.gov/voter-registration/"
      },
      "parties": [
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Idaho online voter registration system, you are required to provide a current and valid ID number issued by the Idaho Department of Motor Vehicle (DMV): Driver’s License; DMV Identification Card<br><br>If your residence does not match the address on your ID, you are required to provide proof of residence to your county elections office or at the polls when you vote in person. You can find a list of approved proof of residence documents and more information at <a href=\"https://voteidaho.gov/voter-registration/\">VoteIdaho.gov</a>.<br><br>If you don’t have an Idaho DMV-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your County Clerk’s office in Idaho.<br><br>If you are registering in person, you are required to provide ONE of the following forms of proof of identity: Idaho Driver’s License; Idaho Identification Card; US passport or federal ID; Tribal ID Card<br><br>You must also show proof of residence when completing a voter registration application in person. Acceptable forms of proof of residence include, but are not limited to, forms of proof of identity if they include the name and address you use to register. <br><br>You can find a full list of approved proof of residence documents and more information at <a href=\"https://voteidaho.gov/voter-registration/\">VoteIdaho.gov</a>.",
      "byMailInstructions": "When submitting your application by mail in Idaho, you are required to provide your Idaho Driver’s License number.<br><br>If you have not been issued an Idaho Driver’s License number, you must provide the last four digits of your Social Security number.<br><br>You must also provide a copy of proof of residence with your voter registration application. Your proof of residency document must include the current name and address you use to register to vote. Acceptable forms include but are not limited to: Idaho Driver’s License; Idaho ID card; Passport or Federal ID; Tribal ID; Enrollment letter from an Idaho high school or university<br><br>You can find a full list of approved proof of residence documents and more information at <a href=\"https://voteidaho.gov/voter-registration/\">VoteIdaho.gov</a>.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:il",
    "registration": {
      "statusUrl": "https://ova.elections.il.gov/RegistrationLookup.aspx",
      "formUrl": "https://elections.il.gov/electionoperations/votingregistrationforms.aspx",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.elections.il.gov/votingandregistrationsystems/register.aspx",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Illinois, you are required to provide your Illinois Driver’s License number, Illinois Secretary of State ID card number, or the last four digits of your Social Security number if you have one. If you have not been issued any of these numbers, indicate you do not have an ID number. If you are registering to vote for the first time in your jurisdiction and you do not include an ID number on your mail-in application, you must submit with your form a copy of ONE of the following forms of ID: current and valid photo identification OR current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address. If you do not include a copy of your ID, you will be required to provide identification when voting for the first time.",
        "signatureInstructions": "To register in Illinois you must: <br>be a United States citizen <br>be a resident of Illinois and of your election precinct at least 30 days before the next election <br>be 18 years old to vote in a Consolidated or General Election or 17 years old to vote in a Consolidated Primary or General Primary Election if you will be 18 by the time of the Consolidated or General Election<br>not be serving a sentence of confinement in any penal institution as a result of conviction of any crime <br>not claim the right to vote anywhere else",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Illinois, you are required to provide the last four digits of your Social Security number and ONE of the following ID numbers with its issuance date: Illinois Drivers License or Illinois State ID number. If you don’t have an Illinois-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
        "url": "https://ova.elections.il.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.elections.il.gov/votingandregistrationsystems/register.aspx"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Illinois online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following ID numbers with its expiration date: Illinois Drivers License; Illinois State ID number<br><br>If you don’t have an Illinois-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You must be at least 17 years old and you must be 18 on or before the next General or Consolidated Election to submit a voter registration application in person in Illinois. You can complete a voter registration application in person at any of the following public agencies in Illinois: County Clerk's Office; schools; public Libraries<br><br>You can find a full list of locations where voter registration is available on the <a href=\"https://www.elections.il.gov/Main/FAQ.aspx#VoterRegistration\">Illinois State Board of Elections</a> website.",
      "byMailInstructions": "You must be at least 17 years old and you must be 18 on or before the next General or Consolidated Election to submit a voter registration application by mail in Illinois. When submitting your application by mail in Illinois, you are required to provide your Illinois Driver’s License number, Illinois Secretary of State ID card number, or the last four digits of your Social Security number, if you have one. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.<br><br>If you are registering to vote for the first time in your jurisdiction and you do not include an ID number on your mail-in application, you must submit with your form a copy of ONE of the following forms of ID: current and valid photo identification; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address<br><br>If you do not include a copy of your ID, you will be required to provide identification when voting for the first time.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:in",
    "registration": {
      "statusUrl": "https://indianavoters.in.gov/",
      "formUrl": "https://indianavoters.in.gov/MVPHome/PrintDocuments",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.in.gov/sos/elections/voter-information/register-to-vote/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Indiana, you are required to provide your Indiana driver’s license number or Indiana Bureau of Motor Vehicles ID Card number. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you do not have a Social Security number, indicate NONE and a voter ID number will be assigned to you.",
        "signatureInstructions": "To register in Indiana you must: <br>be a United States citizen <br>be a resident of Indiana<br>have resided in the precinct at least 30 days before the next election <br>be at least 18 years of age on the day of the next general election <br>not currently be imprisoned following a criminal conviction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction, you must show proof of residency the first time you vote. Acceptable forms of proof of residency documents include: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows the current name and address you used when registering to vote."
      },
      "online": {
        "supported": true,
        "instructions": "To register using the Indiana online voter registration system, you are required to provide the number from your Indiana driver’s license or Indiana identification card issued by the Indiana Bureau of Motor Vehicles. If you don’t have an Indiana-issued driver’s license or identification card, you can still submit a voter registration application by mail or in person.",
        "url": "https://indianavoters.in.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.in.gov/sos/elections/voter-information/register-to-vote/"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Indiana online voter registration system, you are required to provide ONE of the following: Indiana driver's license number; Indiana State Identification Card number<br><br>If you don’t have an Indiana-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Indiana: county voter registration office; Bureau of Motor Vehicles (BMV) license branch when conducting a credential transaction<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://www.in.gov/sos/elections/voter-information/register-to-vote/\">Indiana Election Division</a> website.<br><br>If you are registering for the first time, your application must include your Indiana driver's license number, Indiana state ID number, or the last four digits of your Social Security number. If you do not include an ID number or if the name and address you use when registering does not match an existing Indiana record, you will need to provide proof of residency. Your proof of residency document must include the current name and address you use to register to vote. Acceptable forms include: Indiana driver's license or Indiana-issued ID card; any current and valid photo ID issued by the US government, State of Indiana, or Native American Indian tribe or band recognized by the United States government; current utility bill; bank statement; government check; paycheck; other government document",
      "byMailInstructions": "When submitting your application by mail in Indiana, you are required to provide your Indiana driver’s license number or Indiana Bureau of Motor Vehicles ID Card number. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.<br><br><br>If you do not include an ID number on your registration application or your name or address does not match the information on your existing Indiana record, you must provide a proof of residency document when registering for the first time. You can include a copy of an acceptable document with your application or you may submit an acceptable document to your local election office at any time on or before Election Day. Your proof of residency document must include the current name and address you used to register to vote. Acceptable forms of proof of residency include: Indiana driver's license or Indiana-issued ID card; any current and valid photo ID issued by the US government, State of Indiana, or Native American Indian tribe or band recognized by the United States government; current utility bill; bank statement; government check; paycheck; other government document",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general or municipal election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ks",
    "registration": {
      "statusUrl": "https://myvoteinfo.voteks.org/VoterView",
      "formUrl": "https://sos.ks.gov/forms/elections/voterregistration.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sos.ks.gov/elections/voter-information.html",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Kansas, you are required to provide your current Kansas driver’s license number or nondriver’s identification card number. If you do not have either, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, write “none” in the ID number box.",
        "signatureInstructions": "To register in Kansas you must:<br>be a United States citizen<br>be a Kansas resident<br>be 18 years old by the next election<br>have completed the terms of your sentence if convicted of a felony; a person serving a sentence for a felony conviction is ineligible to vote<br>not claim the right to vote in any other location or under any other name<br>not be excluded from voting by a court of competent jurisdiction",
        "citizenInstructions": null,
        "newVoterInstructions": null
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Kansas, you need a Kansas driver's license or a Kansas non-driver's identification card. If you don’t have a Kansas-issued ID, you can still register by mail or in person.",
        "url": "https://www.kdor.ks.gov/Apps/VoterReg"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sos.ks.gov/elections/voter-information.html"
      },
      "parties": [
        {
          "partyLabelEn": "United Kansas",
          "partyLabelEs": "Kansas Unido",
          "partyPhrasingEn": "United Kansas Party",
          "partyPhrasingEs": "Partido Kansas Unido"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "No Labels",
          "partyLabelEs": "Sin Etiquetas",
          "partyPhrasingEn": "No Labels Party",
          "partyPhrasingEs": "Partido Sin Etiquetas"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Kansas online voter registration system, you are required to provide ONE of the following ID numbers: Kansas driver's license; Kansas non-driver's identification card<br><br>If you don’t have a Kansas-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county election office in Kansas.",
      "byMailInstructions": "When submitting your application by mail in Kansas, you are required to provide your current Kansas driver’s license number or nondriver’s identification card number. If you do not have either, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, write “none” in the ID number box.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-08-04",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ky",
    "registration": {
      "statusUrl": "https://vrsws.sos.ky.gov/VIC/",
      "formUrl": "https://elect.ky.gov/Resources/Documents/SBE%2001%20-%20KY%20Voter%20Registration%20Application%20FILLABLE%20406.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://elect.ky.gov/Resources/Pages/Registration.aspx",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Kentucky, you are required to provide your full Social Security number. If you do not have a Social Security number, leave that field blank. You will not be denied the right to register to vote if you do not include your Social Security number.",
        "signatureInstructions": "To register in Kentucky you must: <br>be a United States citizen <br>be a Kentucky resident for at least 28 days before the election in which you plan to vote<br>be at least 18 years old on or before the next general election<br>have not been convicted of a felony, or if you have been convicted of a felony, your civil rights must have been restored by expungement, Executive Pardon, or Executive Order<br>have not been judged \"mentally incompetent\" in a court of law <br>not claim the right to vote anywhere outside Kentucky",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Kentucky, you need to provide your full Social Security number. If you don’t have a Social Security number, you can still submit a voter registration application by mail.",
        "url": "https://vrsws.sos.ky.gov/ovrweb/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://elect.ky.gov/Resources/Pages/Registration.aspx"
      },
      "parties": [
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Kentucky online voter registration system, you are required to provide your full Social Security number.<br><br>If you don’t have a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county clerk’s office in Kentucky.",
      "byMailInstructions": "When submitting your application by mail in Kentucky, you are required to provide your full Social Security number. <br><br>If you do not have a Social Security number, leave that field blank. You will not be denied the right to register to vote if you do not include your Social Security number.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:la",
    "registration": {
      "statusUrl": "https://voterportal.sos.la.gov/",
      "formUrl": "https://www.sos.la.gov/ElectionsAndVoting/PublishedDocuments/ApplicationToRegisterToVote.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.la.gov/ElectionsAndVoting/RegisterToVote/Pages/default.aspx",
        "forms": "nvrf",
        "raceFieldRequired": ":requested",
        "raceFieldInstructions": "Completing this box is optional.",
        "idInstructions": "You are required to provide your Louisiana driver's license number or Louisiana special ID card number, if you have one. If you do not have a Louisiana driver's license number or Louisiana special ID card number, you are required to include the last four digits of your Social Security number. Your SSN remains confidential and is only used for registration purposes. If you have not been issued any of these numbers, include a copy of ONE of the following: copy of a current and valid photo ID; copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address.",
        "signatureInstructions": "To register in Louisiana you must: <br>be a United States citizen<br>be at least 17 years old (16 years old if registering in person at the Registrar of Voters Office or at the Louisiana Office of Motor Vehicles), and you must be at least 18 years old to vote<br>reside in the state and parish in which you seek to register<br>not be under an order of imprisonment for conviction of a felony or, if under such an order not have been incarcerated pursuant to the order within the last five years and not be under an order of imprisonment related to a felony conviction for election fraud or any other election offense pursuant to La. R.S. 18:1461.2<br>not be under a judgment of full interdiction for mental incompetence or partial interdiction with suspension of voting rights<br>be registered at least 20 days prior to an election if registering through the GeauxVote Online Registration System with a Louisiana driver's license or Louisiana special ID card or 30 days prior to an election if registering in person or by mail to be eligible to vote in that particular election. If mailing in an application, the application or envelope must be postmarked 30 days prior to the first election in which you seek to vote",
        "citizenInstructions": "Your voter registration form must include proof of citizenship. Contact your local election office for more information about acceptable forms of proof of citizenship: https://tvote.org/LA_LEOs",
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck, or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Louisiana, you need to provide the four-digit audit code from your Louisiana driver's license or Louisiana special ID. If you are at least 17 years old and don’t have a Louisiana driver's license or Louisiana special ID, you can still submit a voter registration application by mail.",
        "url": "https://www.sos.la.gov/ElectionsAndVoting/Pages/OnlineVoterRegistration.aspx"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.la.gov/ElectionsAndVoting/RegisterToVote/Pages/default.aspx"
      },
      "parties": [
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Sin Etiquetas",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Sin Etiquetas"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Louisiana online voter registration system, you must be at least 17 years old. You are required to provide the four-digit audit code from your Louisiana driver's license or Louisiana special ID.<br><br>If you are at least 17 years old and don’t have a Louisiana driver's license or Louisiana special ID, you can still submit a voter registration application by mail or in person. If you are 16 years old, you can submit a voter registration application in person at the Registrar of Voters Office or at the Louisiana Office of Motor Vehicles.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Louisiana: Louisiana Office of Motor Vehicles; Registrar of Voters Office<br><br>If you are registering to vote in person at a parish Registrar of Voters Office, you are required to prove age, residency, and identity. <br><br>Acceptable forms include: Louisiana driver’s license or Louisiana special ID card; birth certificate; other documentation that reasonably and sufficiently establishes your identity, age, and residency<br><br>If you are at least 17 years old, you can also complete a voter registration application in person at any mandated site listed on the <a href=\"https://www.sos.la.gov/ElectionsAndVoting/RegisterToVote/Pages/default.aspx\">Louisiana Secretary of State’s</a> website. If you are registering at a mandated site, you only need to provide whatever proof of identification is required for services received that you have applied for at the public agency.",
      "byMailInstructions": "You must be at least 17 years old to submit a voter registration application by mail in Louisiana. When submitting your application by mail in Louisiana, you are required to provide the following ID numbers, if you have them: Louisiana driver’s license or special ID card number; last four digits of your Social Security number<br><br>If you do not have any of these numbers, you must include a copy of ONE of the following: current and valid photo identification; current utility bill, bank statement, government check, paycheck, or another government document",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ma",
    "registration": {
      "statusUrl": "https://www.sec.state.ma.us/VoterRegistrationSearch/MyVoterRegStatus.aspx",
      "formUrl": "https://www.sec.state.ma.us/divisions/elections/download/voter-registration-forms/voter-registration_English.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sec.state.ma.us/divisions/elections/voter-resources/registering-to-vote.htm",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Federal law requires that you provide your Massachusetts driver's license number to register to vote. If you do not have a current and valid Massachusetts driver's license, you must provide the last four digits of your Social Security number. If you have neither, you must write \"NONE\" in the box  and a unique identifying number will be assigned to you.",
        "signatureInstructions": "To register in Massachusetts you must: <br>be a United States citizen<br>be a Massachusetts resident<br>be at least 16 years old (must be 18 years old to vote on Election Day)<br>not have been convicted of corrupt practices in respect to elections<br>not be under guardianship with respect to voting<br>not currently be incarcerated for a felony conviction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in Massachusetts and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Massachusetts, you need ONE of the following ID numbers issued by the Massachusetts Registry of Motor Vehicle (RMV): Driver's License, Learner's Permit, or State ID. If you don’t have a RMV-issued ID, you can still register by mail or in person.",
        "url": "https://www.sec.state.ma.us/OVR/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sec.state.ma.us/divisions/elections/voter-resources/registering-to-vote.htm"
      },
      "parties": [
        {
          "partyLabelEn": "We The People",
          "partyLabelEs": "Nosotros, el Pueblo",
          "partyPhrasingEn": "We The People Party",
          "partyPhrasingEs": "Partido Nosotros, el Pueblo"
        },
        {
          "partyLabelEn": "Workers",
          "partyLabelEs": "Trabajadores",
          "partyPhrasingEn": "Workers Party",
          "partyPhrasingEs": "Partido de los Trabajadores"
        },
        {
          "partyLabelEn": "Working Families",
          "partyLabelEs": "Familias Trabajadoras",
          "partyPhrasingEn": "Working Families Party",
          "partyPhrasingEs": "Partido de las Familias Trabajadoras"
        },
        {
          "partyLabelEn": "World Citizens",
          "partyLabelEs": "Ciudadanos del Mundo",
          "partyPhrasingEn": "World Citizens Party",
          "partyPhrasingEs": "Partido de los Ciudadanos del Mundo"
        },
        {
          "partyLabelEn": "Twelve Visions",
          "partyLabelEs": "Doce Visiones",
          "partyPhrasingEn": "Twelve Visions Party",
          "partyPhrasingEs": "Partido de las Doce Visiones"
        },
        {
          "partyLabelEn": "Timesizing Not Downsizing",
          "partyLabelEs": "Optimización del Tiempo, No Reducción de Personal",
          "partyPhrasingEn": "Timesizing Not Downsizing Party",
          "partyPhrasingEs": "Partido de la Optimización del Tiempo, No Reducción de Personal"
        },
        {
          "partyLabelEn": "The People's",
          "partyLabelEs": "Pueblo",
          "partyPhrasingEn": "The People's Party",
          "partyPhrasingEs": "Partido Pueblo"
        },
        {
          "partyLabelEn": "Socialist",
          "partyLabelEs": "Socialista",
          "partyPhrasingEn": "Socialist Party",
          "partyPhrasingEs": "Partido Socialista"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Reform",
          "partyLabelEs": "Reformista",
          "partyPhrasingEn": "Reform Party",
          "partyPhrasingEs": "Partido Reformista"
        },
        {
          "partyLabelEn": "Rainbow Coalition",
          "partyLabelEs": "Coalición Arcoíris",
          "partyPhrasingEn": "Rainbow Coalition Party",
          "partyPhrasingEs": "Partido de la Coalición Arcoíris"
        },
        {
          "partyLabelEn": "Prohibition",
          "partyLabelEs": "Prohibición",
          "partyPhrasingEn": "Prohibition Party",
          "partyPhrasingEs": "Partido de la Prohibición"
        },
        {
          "partyLabelEn": "Pizza",
          "partyLabelEs": "Pizza",
          "partyPhrasingEn": "Pizza Party",
          "partyPhrasingEs": "Partido Pizza"
        },
        {
          "partyLabelEn": "Pirate",
          "partyLabelEs": "Pirata",
          "partyPhrasingEn": "Pirate Party",
          "partyPhrasingEs": "Partido Pirata"
        },
        {
          "partyLabelEn": "New World Council",
          "partyLabelEs": "Nuevo Consejo Mundial",
          "partyPhrasingEn": "New World Council Party",
          "partyPhrasingEs": "Partido del  Nuevo Consejo Mundial"
        },
        {
          "partyLabelEn": "New Alliance",
          "partyLabelEs": "Nueva Alianza",
          "partyPhrasingEn": "New Alliance Party",
          "partyPhrasingEs": "Partido Nueva Alianza"
        },
        {
          "partyLabelEn": "Natural Law",
          "partyLabelEs": "Ley Natural",
          "partyPhrasingEn": "Natural Law Party",
          "partyPhrasingEs": "Partido de la Ley Natural"
        },
        {
          "partyLabelEn": "Massachusetts Independent",
          "partyLabelEs": "Independiente de Massachusetts",
          "partyPhrasingEn": "Massachusetts Independent Party",
          "partyPhrasingEs": "Partido Independiente de Massachusetts"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Latino-Vote",
          "partyLabelEs": "Voto Latino",
          "partyPhrasingEn": "Latino-Vote Party",
          "partyPhrasingEs": "Partido del  Voto Latino"
        },
        {
          "partyLabelEn": "Interdependent 3rd",
          "partyLabelEs": "Tercer Partido Interdependiente",
          "partyPhrasingEn": "Interdependent 3rd Party",
          "partyPhrasingEs": " Tercer Partido Interdependiente"
        },
        {
          "partyLabelEn": "Green-Rainbow",
          "partyLabelEs": "Arcoíris Verde",
          "partyPhrasingEn": "Green-Rainbow Party",
          "partyPhrasingEs": "Partido del  Arcoíris Verde"
        },
        {
          "partyLabelEn": "Green USA",
          "partyLabelEs": "Verde de EE. UU.",
          "partyPhrasingEn": "Green USA Party",
          "partyPhrasingEs": "Partido Verde de EE. UU."
        },
        {
          "partyLabelEn": "Forward",
          "partyLabelEs": "Avance",
          "partyPhrasingEn": "Forward Party",
          "partyPhrasingEs": "Partido Avance"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Conservative",
          "partyLabelEs": "Conservador",
          "partyPhrasingEn": "Conservative Party",
          "partyPhrasingEs": "Partido Conservador"
        },
        {
          "partyLabelEn": "American Term Limits",
          "partyLabelEs": "Límites de Mandato en Estados Unidos",
          "partyPhrasingEn": "American Term Limits Party",
          "partyPhrasingEs": "Partido de los Límites de Mandato en Estados Unidos"
        },
        {
          "partyLabelEn": "American Independent",
          "partyLabelEs": "Independiente Americano",
          "partyPhrasingEn": "American Independent Party",
          "partyPhrasingEs": "Partido Independiente Americano"
        },
        {
          "partyLabelEn": "America First",
          "partyLabelEs": "Primero Estados Unidos",
          "partyPhrasingEn": "America First Party",
          "partyPhrasingEs": "Partido Primero Estados Unidos"
        },
        {
          "partyLabelEn": "United Independent",
          "partyLabelEs": "Independiente Unido",
          "partyPhrasingEn": "United Independent Party",
          "partyPhrasingEs": "Partido Independiente Unido"
        },
        {
          "partyLabelEn": "Unity",
          "partyLabelEs": "Unidad",
          "partyPhrasingEn": "Unity Party",
          "partyPhrasingEs": "Partido de la Unidad"
        },
        {
          "partyLabelEn": "Veterans America",
          "partyLabelEs": "Veteranos de América",
          "partyPhrasingEn": "Veterans America Party",
          "partyPhrasingEs": "Partido de los Veteranos de América"
        }
      ]
    },
    "youthRegistration": {
      "url": "https://www.sec.state.ma.us/divisions/elections/voter-resources/registering-to-vote.htm",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To pre-register using the Massachusetts online voter registration system you must be at least 16 years old. You are required to provide ONE of the following ID numbers issued by the Massachusetts Registry of Motor Vehicle (RMV): Driver's License; Learner's Permit; State ID<br><br>If you don’t have a RMV-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person and pre-register if you are at least 16 years old and you visit any of the following public agencies in Massachusetts: local town clerk, election commission, and Board of Registrars office; Secretary of the Commonwealth Elections Division office or regional offices",
      "byMailInstructions": "When submitting your pre-registration application by mail in Massachusetts, you must be at least 16 years old. You are required to provide your current and valid Massachusetts Driver’s License number if you have one. If you have not been issued a Massachusetts Driver’s License, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, write “NONE” in the identification number box. <br><br>You are also required to provide a copy of identification if you are registering for the first time and submitting your application by mail. Acceptable forms of proof of residence include: current and valid photo ID; utility bill, bank statement, government check, paycheck, or other government document that shows your name and address<br><br>If you do not include a copy of identification with your voter registration application, you may need to show it the first time you vote.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:md",
    "registration": {
      "statusUrl": "https://voterservices.elections.maryland.gov/votersearch",
      "formUrl": "https://elections.maryland.gov/voter_registration/documents/VRA-English.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://elections.maryland.gov/voter_registration/application.html",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "If you have a current, valid Maryland driver's license or a Motor Vehicle Administration identification card (MVA ID), you must enter your driver's license or identification number. If you do not have a current, valid Maryland driver's license or MVA ID, you must enter the last 4 digits of your Social Security number.",
        "signatureInstructions": "To register in Maryland you must: <br>be a U.S. citizen <br>be a Maryland resident <br>be at least 16 years old (you must be at least 18 years old on or before a general election to vote)<br>not have been convicted of buying or selling votes <br>not be currently serving a sentence of imprisonment for a felony conviction<br>not be under guardianship for mental disability or if you are, you have not been found by a court to be unable to communicate a desire to vote",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: <br>current and valid photo identification or<br>current utility bill, bank statement, government check, paycheck or government document that shows your name and address  (dated within three months)<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>"
      },
      "online": {
        "supported": true,
        "instructions": "You need an ID issued by the Maryland Motor Vehicle Administration (MVA) and a Social Security number to use Maryland's online voter registration system.",
        "url": "https://voterservices.elections.maryland.gov/OnlineVoterRegistration/InstructionsStep1"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://elections.maryland.gov/voter_registration/index.html"
      },
      "parties": [
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Working Class",
          "partyLabelEs": "Clase Trabajadora",
          "partyPhrasingEn": "Working Class Party",
          "partyPhrasingEs": "Partido de la Clase Trabajadora"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": "https://www.elections.maryland.gov/voter_registration/17_year_olds.html",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Maryland online voter registration system, you are required to provide the last four digits of your Social Security Number and ONE of the following: Maryland driver’s license number; Maryland state ID number",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Maryland: Maryland Motor Vehicle Administration (MVA) offices; local board of elections; Maryland public higher education institutions<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://elections.maryland.gov/voter_registration/index.html\">Maryland State Board of Elections</a> website.<br><br>If you are registering to vote in person, you are required to provide Proof of residence. Acceptable forms include: MVA-issued license, ID card, or change of address card; paycheck, bank statement, utility bill, or other government document with your name and address",
      "byMailInstructions": "When submitting your application by mail in Maryland, you are required to provide your Maryland driver’s license or state-issued ID card number. If you do not have a Maryland-issued ID, you must include the last four digits of your Social Security number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:me",
    "registration": {
      "statusUrl": null,
      "formUrl": "https://www.maine.gov/sos/sites/maine.gov.sos/files/content/assets/Voter-20Registration-20Card-20--20Rev-201-25-20Fillable.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.maine.gov/sos/elections-voting/state-of-maine-voter-guide",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Maine, you are required to provide your Maine driver’s license or State ID number. If you do not have a Maine driver’s license or State ID, you are required to include the last four digits of your Social Security number. If you have not been issued any of these numbers, write \"NONE\" in the space for ID number.",
        "signatureInstructions": "To register in Maine you must: <br>be a United States citizen<br>be a resident of Maine and the municipality in which you want to vote <br>be at least 16 years old (you must be at least 18 years old to vote, except that you may vote in a primary election if you are 17 and will be 18 by the General Election)",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Maine, you need to provide at least ONE of the following: Maine driver’s license number, Maine state ID card number, or the last four digits of your Social Security number. If you don’t have a Maine driver’s license, Maine state ID card, or Social Security number, you can still submit a voter registration application by mail.",
        "url": "https://registertovote.sos.maine.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.maine.gov/sos/elections-voting/state-of-maine-voter-guide"
      },
      "parties": [
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Green Independent",
          "partyLabelEs": "Verde Independiente",
          "partyPhrasingEn": "Green Independent Party",
          "partyPhrasingEs": "Partido Verde Independiente"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Maine online voter registration system, you are required to provide at least ONE of the following: Maine driver’s license number; Maine state ID card number; last four digits of your Social Security number<br><br>If you don’t have a Maine driver’s license, Maine ID card, or Social Security number, you can still submit a voter registration application in person or by mail.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Maine: town office or city hall; Motor Vehicle branch office; most state and federal social service agencies. Contact the agency before you go to confirm they offer in-person registration.<br><br>If you are registering to vote for the first time in Maine, you are required to provide proof of identity that demonstrates residence in Maine.<br><br>Acceptable forms include: government document or credential with photo ID; government ID document/credential without photo; official document that shows your name and address; student photo ID from a state-approved public or private school or institute of higher education in Maine; Maine driver’s license or State ID card number; last four digits of Social Security number; <br><br>View the <a href=\"https://www.maine.gov/sos/elections-voting/state-of-maine-voter-guide\">State of Maine Voter Guide</a> for examples.",
      "byMailInstructions": "When submitting your application by mail in Maine, you are required to provide your Maine driver’s license or State ID number. If you do not have a Maine driver’s license or State ID, you are required to include the last four digits of your Social Security number. If you have not been issued any of these numbers, write \"NONE\" in the space for ID number. <br><br>If it is your first time registering to vote in Maine, you are also required to provide a copy of one of the following: Maine driver’s license; Maine State ID card; current utility bill, bank statement, or government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unavailable",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:mi",
    "registration": {
      "statusUrl": "https://mvic.sos.state.mi.us/Voter/Index",
      "formUrl": "https://www.michigan.gov/sos/-/media/Project/Websites/sos/Elections/Election-Forms/Voter-Registration-Form-English.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://mvic.sos.state.mi.us/Home/RegisterToVote#register",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Your completed voter registration form must contain your Michigan driver's license number or Michigan-issued personal identification card number. If you do not have a driver's license or state issued personal identification card, you must include the last four digits of your Social Security number. If you do not have a driver's license or a state issued personal identification card or a Social Security number, please write \"NONE\" on the form. A unique identifying number will be assigned by the State.",
        "signatureInstructions": "To register in Michigan you must: <br>be a United States citizen <br>be at least 16 years old (18 when you vote) <br>be a resident of Michigan when you register<br>be a resident of your city or township for at least 30 days when you vote<br>not currently be serving a sentence in jail or prison",
        "citizenInstructions": "You are required to use the same address for your voter registration and driver’s license in Michigan. If the residence address you provide on your voter registration form differs from the address shown on your driver's license or personal identification card issued by the State of Michigan, the Secretary of State will automatically change your driver's license or personal identification card address to match the one on your registration. The Secretary of State will mail you an address update sticker for your license or personal identification card if an address change is made.",
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "You need a Michigan driver's license or state ID and the last four digits of your Social Security number to use Michigan's online voter registration system. If you don’t have a Social Security number or Michigan-issued ID, you can still submit a voter registration application by mail or in person.",
        "url": "https://mvic.sos.state.mi.us/RegisterVoter"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://mvic.sos.state.mi.us/Home/RegisterToVote#where"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": "https://www.michigan.gov/sos/elections/voting/first-time-voters",
      "formUrl": "https://www.michigan.gov/sos/-/media/Project/Websites/sos/Elections/Election-Forms/ED-121a-Michigan-Voter-Preregistration-Application-and-Change-of-Address-Form.pdf?rev=2a0413ce83e24577ab6bbe36f2c08df7&amp;hash=E53D1A3FBE546E4AACEE451E4EAD332A",
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Michigan online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following: Michigan driver’s license; Michigan state ID number <br><br>If you don’t have a Social Security number or Michigan-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Michigan: Secretary of State branch office; city, township, or county clerk’s office; any state agency that provides public assistance or services to people with disabilities",
      "byMailInstructions": "When submitting your application by mail in Michigan, you are required to provide your Michigan-issued driver’s license or state ID number. If you do not have a Michigan-issued ID, you must include the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. You must also include a copy of one of the following forms of identification when mailings this form to your county, city, or township clerk: current and valid photo identification (such as a driver’s license or state ID from any state); paycheck stub, utility bill, bank statement, or a government document that lists your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:mn",
    "registration": {
      "statusUrl": "https://mnvotes.sos.mn.gov/voterstatuscheck/index",
      "formUrl": "https://www.sos.mn.gov/media/5975/minnesota-voter-registration-application.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.mn.gov/elections-voting/register-to-vote/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "You are required to provide your Minnesota driver's license or state ID number to register to vote. If you do not have a Minnesota driver's license or state ID, you will have to provide the last four digits of your Social Security number. If you have neither, indicate \"NONE\" on the form.",
        "signatureInstructions": "To register in Minnesota you must:<br>be a United States citizen<br>be a Minnesota resident for 20 days before the next election<br>maintain residence at the address given on the registration form<br>be at least 16 years old (you must be at least 18 years old to vote)<br>not currently be incarcerated for a conviction of a felony offense<br>not be under a court-ordered guardianship in which the right to vote has been revoked<br>not be found by a court to be legally incompetent to vote",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Minnesota, you need to provide your email address and ONE of the following: Minnesota driver’s license number, Minnesota identification card number, OR the last four digits of your Social Security number. If you don’t have a Minnesota-issued ID or Social Security number, you can still submit a voter registration application by mail.",
        "url": "https://mnvotes.sos.mn.gov/VoterRegistration/index"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.mn.gov/elections-voting/register-to-vote/"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": "https://www.sos.mn.gov/elections-voting/register-to-vote/",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Minnesota online voter registration system, you are required to provide your email address and ONE of the following: Minnesota driver’s license number; Minnesota identification card number; last four digits of your Social Security number<br><br>If you don’t have a Minnesota-issued ID or Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can register to vote in person at a Driver and Vehicle Services Office when applying for or renewing a Minnesota driver’s license or state ID. To register to vote, you must check the box on your driver’s license or state ID application. The Department of Public Safety (DPS) will review citizenship documentation and ensure you meet all other eligibility requirements before sending your information to the Minnesota Secretary of State’s office.",
      "byMailInstructions": "When submitting your application by mail in Minnesota, you are required to provide your Minnesota-issued driver’s license or Minnesota ID card number. If you do not have a Minnesota state-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:mo",
    "registration": {
      "statusUrl": "https://voteroutreach.sos.mo.gov/portal/",
      "formUrl": "https://s1.sos.mo.gov/Elections/VoterRegistration/Home/Print",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://s1.sos.mo.gov/Elections/VoterRegistration/Home/Print",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Your completed voter registration form must contain your Missouri driver's license number and the last four digits of your Social Security number. If you do not have a driver's license or a Social Security number, please indicate “NONE” on the form. A unique identifying number will be assigned by the State.",
        "signatureInstructions": "To register in Missouri you must: <br>be a United States citizen <br>be a resident of Missouri <br>be at least 17-1/2 years of age (you must be 18 to vote) <br>not be on probation or parole after conviction of a felony, until finally discharged from such probation or parole <br>not be convicted of a felony or misdemeanor connected with the right of suffrage <br>not be adjudged incapacitated by any court of law <br>not be confined under a sentence of imprisonment",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. You will be required to present a government-issued photo ID when you vote."
      },
      "online": {
        "supported": true,
        "instructions": "Missouri requires that you use a tablet, mobile device, or other touchscreen device to register online to vote. This is because you will be required to provide a signature during the process.",
        "url": "https://s1.sos.mo.gov/elections/voterregistration/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.mo.gov/elections/goVoteMissouri/pickupmail"
      },
      "parties": [
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Missouri online voter registration system, you are required to use a tablet, mobile device, or another touchscreen device. This is because you will be required to provide a signature during the process. <br><br>If you don’t have a touchscreen device, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Missouri: County Clerk’s office; Department of Motor Vehicles office; any state agency providing service to the public",
      "byMailInstructions": "When submitting your application by mail in Missouri, you are required to provide your Missouri driver’s license number and the last four digits of your Social Security number. If you have not been issued either or both of these numbers, leave the corresponding box blank.<br><br>When submitting a registration application by mail and registering to vote for the first time, you can optionally provide a copy of ONE of the following forms of identification: current or valid photo ID; current utility bill, bank statement government check, paycheck, or other government document that shows your name and address; birth certificate; Native American tribal document; other proof of United States citizenship<br><br>You will be required to present a government-issued photo ID when you vote.",
      "eligibilityAge": "P17Y6M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ms",
    "registration": {
      "statusUrl": "https://www.msegov.com/sos/voter_registration/AmIRegistered",
      "formUrl": "https://www.sos.ms.gov/content/documents/elections/Mail-in%20Voter%20Registration%20Application.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.ms.gov/elections-voting/faqs#ar01",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "You are required to provide your current and valid Mississippi driver's license number or, if you don't have one, the last four digits of your Social Security number. If you have not been issued any of these numbers, include a copy of ONE of the following: current and valid photo ID or current utility bill, bank statement, government check, paycheck or other government document that shows your name and address.",
        "signatureInstructions": "To register in Mississippi you must: <br>be a United States citizen <br>have lived in Mississippi and in your county, city, or town for 30 days before the election in which you want to vote <br>be 18 years old by the time of the general election in which you want to vote <br>have not been convicted in a Mississippi court of voter fraud, arson, armed robbery, bigamy, bribery, carjacking, embezzlement, extortion, felony bad check, felony shoplifting, forgery, larceny, murder, obtaining money or goods under false pretense, perjury, rape, receiving stolen property, robbery, statutory rape, theft, timber larceny, larceny under lease or rental agreement, or unlawful taking of motor vehicle (unless having been pardoned, had rights of citizenship restored by the Governor or had suffrage restored by the Legislature.)<br>not have been declared mentally incompetent by a court",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes:<br>A current and valid photo identification OR <br>A current utility bill, bank statement, government check, paycheck or government document that shows your name and address. <br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.ms.gov/elections-voting/faqs#ar01"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Mississippi: Circuit Clerk and Municipal Clerk’s office; Department of Public Safety when getting a driver’s license<br><br>You can also find a list of locations that provide voter registration applications on the <a href=\"https://www.sos.ms.gov/voter-id/register\">Mississippi Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Mississippi, you are required to provide ONE of the following ID numbers: Mississippi Driver’s License; last four digits of Social Security number<br><br>If you do not have a Mississippi Driver’s or Social Security number, you must include with your mail-in voter registration application a copy of ONE of the following forms of identification: current and valid photo ID; current utility bill, bank statement, government check, paycheck or other government document that shows your name and address in the county where you register",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:mt",
    "registration": {
      "statusUrl": "https://prodvoterportal.mt.gov/WhereToVote.aspx",
      "formUrl": "https://votemt.gov/voter-registration/",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sosmt.gov/elections/faq/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "You must provide your Montana driver's license number, Montana ID card number, or the last 4 digits of your Social Security number. If you have not been issued any of these numbers, indicate “NONE” in the identification number box and include a copy of ONE of the following: United States passport; Montana tribal ID card; military ID card; Montana concealed carry permit; photo identification, including, but not limited to, a school district or postsecondary education photo identification with your name AND a current utility bill, bank statement, paycheck, government check, or other government document that shows your name and current address",
        "signatureInstructions": "To register in Montana you must: <br>be a United States citizen <br>be at least 18 years old on or before the election <br>be a resident of Montana and of the county in which you want to vote for at least 30 days before the next election <br>not be in a penal institution for a felony conviction <br>not currently be determined by a court to be of unsound mind",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sosmt.gov/elections/faq/"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your county election office in Montana. You can also fill out and sign a registration form when you apply for or renew your driver’s license or Montana ID. <br><br>If you are registering to vote in person, you are required to provide an original version of ONE form of identification. Acceptable forms include: military ID card; tribal photo ID card; US passport; Montana concealed carry permit; photo ID with your name (includes school district and postsecondary education photo ID); current utility bill, bank statement, paycheck, government check, or other government document that shows your name and current address",
      "byMailInstructions": "When submitting your application by mail in Montana, you are required to provide your current Montana driver’s license number or Montana state ID card number. If you do not have either, you must provide the last four digits of your Social Security number. If you are unable to provide these ID numbers, check the box that indicates you do not have an ID number and include with your application a copy of ONE form of identification. Acceptable forms include: military ID card; tribal photo ID card; US passport; Montana concealed carry permit; photo ID with your name (includes school district and postsecondary education photo ID) AND current utility bill, bank statement, paycheck, government check, or other government document that shows your name and current address",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-06-02",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:nc",
    "registration": {
      "statusUrl": "https://vt.ncsbe.gov/RegLkup/",
      "formUrl": "https://s3.amazonaws.com/dl.ncsbe.gov/Voter_Registration/NCVoterRegForm_06W.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.ncsbe.gov/registering/how-register",
        "forms": "nvrf",
        "raceFieldRequired": ":requested",
        "raceFieldInstructions": "You are required to fill in this box; however, your application will not be rejected if you fail to do so.",
        "idInstructions": "When submitting a voter registration application by mail in North Carolina, you are required to provide your valid North Carolina driver’s license or DMV ID number. If you do not have a North Carolina-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate you do not have an ID number and include a copy of ONE of the following: current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address.",
        "signatureInstructions": "To register in North Carolina you must: <br>be a United States citizen <br>be a resident of North Carolina and the county where you live for at least 30 days before the election<br>be 18 years old by the day of the next General Election. You may pre-register to vote if you are at least 16 years old. You may vote in a primary election if you will be 18 years old at the time of the General Election<br>not be serving a felony sentence, including any period of probation, post-release supervision, or parole",
        "citizenInstructions": null,
        "newVoterInstructions": "If you registered to vote for the first time and did not provide a North Carolina driver license number or last four digits of your Social Security number on your registration application, or you provided a number that could not be validated, you will be required to show proof of identification. Proof of identification includes: <br>Current and valid photo identification,<br>Current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in North Carolina, you must be an existing North Carolina Division of Motor Vehicles (NCDMV) customer and you will need your DMV-issued driver’s license or ID number and Social Security number. Existing DMV customers may register to vote, update their voter registration address, or update their party affiliation. They may not change their name. If you don’t have a NCDMV-issued ID, you can still submit a voter registration application by mail or in person at your county election office.",
        "url": "https://www.ncdot.gov/dmv/offices-services/online/Pages/voter-registration-application.aspx"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.ncsbe.gov/registering/how-register/register-person-during-early-voting"
      },
      "parties": [
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        }
      ]
    },
    "youthRegistration": {
      "url": "https://www.ncsbe.gov/registering/who-can-register/preregistering-vote-when-you-are-16-or-17-years-old",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register online in North Carolina, you must be at least 17 years old. You must be an existing North Carolina Division of Motor Vehicles (NCDMV) customer and you will need your DMV-issued driver’s license or ID number and Social Security number.<br><br>If you don’t have a NCDMV-issued ID, you can still submit a voter registration application by mail or in person at your county election office.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in North Carolina: County Board of Elections; North Carolina Division of Motor Vehicles (NCDMV)<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://www.ncsbe.gov/registering/national-voter-registration-act-nvra\">North Carolina State Board of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in North Carolina, you are required to provide your valid North Carolina driver’s license or DMV ID number. If you do not have a North Carolina-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: current utility bill; bank statement; government check; paycheck; other government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:nd",
    "registration": {
      "statusUrl": null,
      "formUrl": null,
      "noRegistrationRequiredInstructions": "North Dakota does not register voters. If you are an eligible resident of North Dakota, you're already set to vote!",
      "methods": [
        "notApplicable"
      ],
      "byMail": {
        "supported": false,
        "url": null,
        "forms": null,
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": null,
        "signatureInstructions": null,
        "citizenInstructions": null,
        "newVoterInstructions": null
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": null
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "notApplicable",
      "methods": null,
      "onlineInstructions": null,
      "inPersonInstructions": null,
      "byMailInstructions": null,
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": null,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ne",
    "registration": {
      "statusUrl": "https://www.votercheck.necvr.ne.gov/voterview",
      "formUrl": "https://sos.nebraska.gov/sites/sos.nebraska.gov/files/doc/elections/vr-fillable.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sos.nebraska.gov/elections/registering-vote",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Nebraska, you are required to provide your Nebraska driver’s license or state ID number. If you do not have a Nebraska-issued ID, you are required to provide the last four digits of your Social Security number.",
        "signatureInstructions": "To register in Nebraska you must:<br>be a citizen of the United States <br>be a resident of Nebraska and of the county where you are registering; if you move to another county, you must re-register<br>be at least 18 years of age or will be 18 years of age on or before the first Tuesday after the first Monday of November <br>not be convicted of a felony and currently serving a sentence, either in Nebraska or another state or in federal court (your voting rights are restored upon completing your sentence, including any probation or parole term)<br>not have been officially found to be mentally incompetent",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes:<br>A current and valid photo identification or<br>A current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Nebraska, you need a valid Nebraska State ID or Driver’s License. If you don’t have a Nebraska-issued ID, you can still submit a voter registration application by mail or in person.",
        "url": "https://www.nebraska.gov/apps-sos-voter-registration/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sos.nebraska.gov/elections/registering-vote"
      },
      "parties": [
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Legal Marijuana Now",
          "partyLabelEs": "Legal Marijuana Now",
          "partyPhrasingEn": "Legal Marijuana Now Party",
          "partyPhrasingEs": "Partido Legal Marijuana Now"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Nebraska online voter registration system, you are required to provide ONE of the following ID numbers: Nebraska driver’s license; Nebraska state-issued ID card<br><br>If you don’t have a Nebraska-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county election office or at the Department of Motor Vehicles (DMV) when applying for or renewing your driver's license in Nebraska.<br><br>You can also register in person at the following public agencies at the time of application, review, or change of address in connection with public programs: Department of Health and Human Services; State Department of Education",
      "byMailInstructions": "When submitting your application by mail in Nebraska, you are required to provide your Nebraska driver’s license or state ID number. If you do not have a Nebraska-issued ID, you are required to provide the last four digits of your Social Security number.<br><br>If you are registering to vote for the first time in Nebraska and you mail your registration application, you must provide a copy of proof of identity so that you avoid delays with your registration. Acceptable forms include: current and valid photo ID; utility bill, bank statement, government check, paycheck, or other government document that is dated within 60 days immediately before submitting your application and shows the same name and residence address on your voter registration form",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:nh",
    "registration": {
      "statusUrl": "https://app.sos.nh.gov/voterinformation",
      "formUrl": null,
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "callClerk",
        "electionDay"
      ],
      "byMail": {
        "supported": false,
        "url": null,
        "forms": null,
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": null,
        "signatureInstructions": null,
        "citizenInstructions": null,
        "newVoterInstructions": null
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.nh.gov/elections/register-vote/town-or-city-clerks-office"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your town hall in New Hampshire. <br><br>If you are registering in person, you are required to provide proof of your identity, age, citizenship, and domicile (home address) to register.<br><br>Acceptable forms of proof of identity and age include: driver’s license from any state; non-driver ID from any state<br><br>Acceptable forms of proof of citizenship include: birth certificate; US Passport/Passcard; naturalization document<br><br>You will also need to prove that your domicile (home) is in the town or ward where you intend to vote. You can find a full list of acceptable forms of proof of domicile on the <a href=\"https://www.sos.nh.gov/sites/g/files/ehbemt561/files/inline-documents/sonh/registering-to-vote-in-new-hampshire-february-2025_3.pdf\"> New Hampshire Secretary of State’s</a> website.",
      "byMailInstructions": "You can only submit a voter registration application by mail if you: will be absent from your town or city when the Supervisors of the Checklist meet to receive voter registration applications; are unable to vote in person because of a physical disability; cannot appear in person because of observance of a religious commitment; are a victim of domestic violence and have an active protective order; are confined to a penal institution awaiting trial or because of a misdemeanor conviction<br><br>Contact your <a href=\"https://app.sos.nh.gov/clerkinformation\">city clerk</a> to request an absentee (mail-in) voter registration application.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-09-08",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:nj",
    "registration": {
      "statusUrl": "https://voter.svrs.nj.gov/registration-check",
      "formUrl": "https://nj.gov/state/elections/assets/pdf/forms-voter-registration/68-voter-registration-english.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://nj.gov/state/elections/voter-registration.shtml",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in New Jersey, you are required to provide your New Jersey Driver’s License number or non-driver ID card number issued by the New Jersey Motor Vehicle Commission (MVC). If you do not have a New Jersey-issued ID, you must provide the last four digits of your Social Security Number. If you have not been issued any of these numbers, indicate you do not have an ID number and include a copy of ONE of the following with your application: current and valid photo ID or document with your name and current address. If you do not include a copy of acceptable ID with your application, you will need to verify your identity the first time you vote.",
        "signatureInstructions": "To register in New Jersey you must: <br>be a United States citizen<br>be at least 17 years old (you must be at least 18 to vote, except that you may vote in a primary election if you are 17 and will be 18 by the next general election)<br>be a resident of the state of New Jersey and the county in which you register for at least 30 days before the election in which you vote<br>not be serving a sentence of incarceration as the result of a conviction of any indictable offense under the laws of New Jersey or another state or of the United States",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in New Jersey, you need to provide your New Jersey Driver’s License number OR non-driver ID card number issued by the New Jersey Motor Vehicle Commission (MVC). If you do not have a New Jersey-issued ID, you must provide your Social Security number AND use a device that allows you to sign on-screen or upload your signature. If you don’t have any of the above, you can still submit a voter registration application by mail.",
        "url": "https://voter.svrs.nj.gov/register"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://nj.gov/state/elections/voter-registration.shtml"
      },
      "parties": [
        {
          "partyLabelEn": "Conservative",
          "partyLabelEs": "Conservador",
          "partyPhrasingEn": "Conservative Party",
          "partyPhrasingEs": "Partido Conservador"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Natural Law",
          "partyLabelEs": "Ley Natural",
          "partyPhrasingEn": "Natural Law Party",
          "partyPhrasingEs": "Partido de la Ley Natural"
        },
        {
          "partyLabelEn": "Reform",
          "partyLabelEs": "Reformista",
          "partyPhrasingEn": "Reform Party",
          "partyPhrasingEs": "Partido Reformista"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Socialist",
          "partyLabelEs": "Socialista",
          "partyPhrasingEn": "Socialist Party",
          "partyPhrasingEs": "Partido Socialista"
        },
        {
          "partyLabelEn": "US Constitution",
          "partyLabelEs": "Constitución de los Estados Unidos",
          "partyPhrasingEn": "US Constitution Party",
          "partyPhrasingEs": "Partido de la Constitución de los Estados Unidos"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the New Jersey online voter registration system, you are required to provide your New Jersey Driver’s License number or non-driver ID card number issued by the New Jersey Motor Vehicle Commission (MVC). If you do not have a New Jersey-issued ID, you must provide your Social Security number AND use a device that allows you to sign on-screen or upload your signature.<br><br>If you don’t have any of the above, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can register to vote in person at a motor vehicle agency while applying for or renewing a driver’s license or non-driver ID card with the New Jersey Motor Vehicle Commission (MVC). The MVC will report the information to the New Jersey Division of Elections.",
      "byMailInstructions": "When submitting your application by mail in New Jersey, you are required to provide your New Jersey Driver’s License number or non-driver ID card number issued by the New Jersey Motor Vehicle Commission (MVC). If you do not have a New Jersey-issued ID, you must provide the last four digits of your Social Security Number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following with your application: current and valid photo ID; document with your name and current address<br><br>If you do not include a copy of acceptable ID with your application, you will need to verify your identity the first time you vote.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:nm",
    "registration": {
      "statusUrl": "https://voterportal.servis.sos.state.nm.us/WhereToVote.aspx",
      "formUrl": "https://www.sos.nm.gov/wp-content/uploads/2024/11/VoterReg_SHELL_2023_ENG.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.nm.gov/voting-and-elections/voter-information-portal-nmvote-org/voter-registration-information/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "You must provide your New Mexico driver's license or state ID number. If you don't have one, you can use the last four digits of your Social Security number. This registration card containing the last four digits of your Social Security number will become part of the permanent voter registration records of your locality, which are open to inspection by the public in the office of the county clerk. However, the last four digits of your Social Security number and date of birth will remain confidential and will not be disclosed to the public. Computerized listings of limited voter registration information (without Social Security number or birth date) are available to the general public, and are furnished upon request to incumbent election officeholders, candidates, political parties, courts, and non‐profit organizations promoting voter participation and registration, for political purposes only (Sec.1-5-19B, NMSA 1978).",
        "signatureInstructions": "To register in New Mexico you must: <br>be a United States citizen <br>be a resident of the State of New Mexico <br>be 18 years of age at the time of the next election <br>not currently be incarcerated for a felony conviction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes a current and valid photo identification or<br>a current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in New Mexico, you need a Social Security number and either a New Mexico Driver’s License or a New Mexico Motor Vehicles Division (MVD) ID. If you don’t have a New Mexico-issued ID, you can still register by mail.",
        "url": "https://portal1.sos.nm.gov/OVR/WebPages/InstructionsStep1.aspx"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.nm.gov/voting-and-elections/voting-faqs/voter-registration/"
      },
      "parties": [
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the New Mexico online voter registration system, you are required to provide your Social Security number and ONE of the following ID numbers: New Mexico driver’s license; New Mexico state ID<br><br>If you don’t have a New Mexico-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in New Mexico: New Mexico Secretary of State’s office; County Clerk; Motor Vehicle Division (MVD)",
      "byMailInstructions": "When submitting your application by mail in New Mexico, you are required to provide your New Mexico driver's license number, state ID number, or the last four digits of your Social Security number.<br><br>If you are registering to vote for the first time in New Mexico and you mail your registration application, you must include a copy of proof of identity with your form or present ID when voting in person or absentee. Acceptable forms include: current and valid photo identification; current utility bill, bank statement, government check, paycheck, student identification card, or other government document that shows your name and current address (includes tribal ID)",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:nv",
    "registration": {
      "statusUrl": "https://www.nvsos.gov/votersearch/",
      "formUrl": "https://www.nvsos.gov/SOSVoterRegForm/",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.nvsos.gov/sos/elections/voters/registering-to-vote",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Nevada, you are required to provide your Nevada driver’s license or state ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate NONE. If you select this option, you will be contacted by your County Election Department for more information once your application is received.",
        "signatureInstructions": "To register in Nevada you must: <br>be a citizen of the United States <br>be at least 17 years old and be at least 18 years old on or before Election Day in order to vote<br>have continuously resided in your county in the state of Nevada for at least 30 days and continuously resided in your precinct for at least 10 days before the next election in which you intend to vote<br>not currently be serving a term of imprisonment for a felony conviction <br>not be determined by a court of law to be mentally incompetent <br>claim no other place as your legal residence",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes:<br>current and valid photo identification or<br>current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>"
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Nevada, you need a current and valid driver’s license or ID card issued by the Nevada DMV and the last four digits of your Social Security number. If you don’t have a Nevada-issued ID or Social Security number, you can still register by mail or in person.",
        "url": "https://registertovote.nv.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.nvsos.gov/sos/elections/voters/registering-to-vote"
      },
      "parties": [
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Forward",
          "partyLabelEs": "Avance",
          "partyPhrasingEn": "Forward Party",
          "partyPhrasingEs": "Partido Avance"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Independent American",
          "partyLabelEs": "Independiente Estadounidense",
          "partyPhrasingEn": "Independent American Party",
          "partyPhrasingEs": "Partido Independiente Estadounidense"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Nevada online voter registration system, you are required to provide: current and valid driver’s license or ID card issued by the Nevada DMV; last four digits of your Social Security number<br><br>If you don’t have a Nevada-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Nevada: Nevada Department of Motor Vehicles (DMV); County Clerk or Registrar of Voters Office; college campuses; various social service agencies<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://www.nvsos.gov/sos/elections/voters/registering-to-vote/national-voter-registration-act-nvra/nvra-voter-registration-agencies\">Nevada Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Nevada, you are required to provide your Nevada driver’s license or state ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. If you select this option, you will be contacted by your County Election Department for more information once your application is received.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ny",
    "registration": {
      "statusUrl": "https://voterlookup.elections.ny.gov/",
      "formUrl": "https://elections.ny.gov/system/files/documents/2025/04/2025-vr-form-english-_fillable_.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://elections.ny.gov/voter-registration-process#registration-forms",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in New York, you are required to provide your valid New York State driver's license, permit, or ID number. If you do not have a New York State-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate NONE.",
        "signatureInstructions": "To register in New York you must: <br>be a United States citizen <br>be a resident of the state of New York and the county, city, or village in which you register for at least 30 days before the election in which you vote<br>be 18 years old (you may pre-register at 16 or 17 but cannot vote until you are 18)<br>not be in prison for a felony conviction<br>not be adjudged mentally incompetent by a court<br>not claim the right to vote elsewhere",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes:<br>A current and valid photo identification OR <br>A current utility bill, bank statement, government check, paycheck, or government document that shows your name and address. <br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in New York, you need a NY.Gov ID. If you have previously used NY.Gov with another agency, you may use the same login to access the Online Voter Registration portal. If you have not used NY.Gov, you will need to create an account.<br><br>You will be asked to provide your New York State-issued ID number. If you don’t have a New York State-issued ID, you can still submit a voter registration application online, but you will have to show ID the first time you vote. You can also submit a voter registration application by mail or in person.",
        "url": "https://elections.ny.gov/voter-registration-process#register-online"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://elections.ny.gov/voter-registration-process#registration-forms"
      },
      "parties": [
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Conservative",
          "partyLabelEs": "Conservador",
          "partyPhrasingEn": "Conservative Party",
          "partyPhrasingEs": "Partido Conservador"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Working Families",
          "partyLabelEs": "Familias Trabajadoras",
          "partyPhrasingEn": "Working Families Party",
          "partyPhrasingEs": "Partido de las Familias Trabajadoras"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the New York online voter registration system, you need a NY.Gov ID. If you have previously used NY.Gov with another agency, you may use the same login to access the Online Voter Registration portal. If you have not used NY.Gov, you will need to create an account.<br><br>You will be asked to provide your New York State-issued ID number. If you don’t have a New York State-issued ID, you can still submit a voter registration application online, but you will have to show ID the first time you vote. You can also submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in New York: County Board of Elections; Department of Motor Vehicles (DMV) when you apply for or renew your driver license or ID card; City Universities of New York (CUNY); State Universities of New York (SUNY)<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://elections.ny.gov/national-voter-registration-act-nvra#agency-based-voter-registration\">New York State Board of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in New York, you are required to provide your valid New York State driver's license, permit, or ID number. If you do not have a New York State-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:oh",
    "registration": {
      "statusUrl": "https://voterlookup.ohiosos.gov/voterlookup.aspx",
      "formUrl": "https://www.ohiosos.gov/globalassets/elections/forms/vr_form_english.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.ohiosos.gov/elections/voters/register/#register",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Your Social Security number is requested. Providing this number is voluntary. This information allows the Board of Elections to verify your registration if necessary (O.R.C. 3503.14). [Federal law requires that you provide your Ohio driver's license number to register to vote. If you do not have a driver's license then you will have to provide at least the last four digits of your Social Security number. If you don't have either number you will have to write \"NONE\" on the form and the State will assign you a number.]",
        "signatureInstructions": "To register in Ohio you must:<br>be a United States citizen<br>be a resident of Ohio for at least 30 days immediately before the election in which you want to vote<br>be at least 18 years old on or before the day of the next general election day (if you will be 18 on or before the day of the general election, you may vote in the primary election for candidates only, but you cannot vote on party central committees until you are 18)<br>not be incarcerated (in jail or in prison) for a felony conviction<br>not be found incompetent by a court for purposes of voting by a probate court<br>not be permanently disenfranchised for violations of election laws",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Ohio, you need the last four digits of your Social Security number and either an Ohio driver’s license or an Ohio identification card number. If you don’t have an Ohio-issued ID or Social Security number, you can still register by mail or in person.",
        "url": "https://olvr.ohiosos.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.ohiosos.gov/elections/voters/register/#register"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Ohio online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following ID numbers: Ohio driver’s license; Ohio identification card number<br><br>If you don’t have an Ohio-issued ID or Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Ohio: county board of elections; Ohio Bureau of Motor Vehicles (BMV); public libraries; public high schools or vocational schools<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://www.ohiosos.gov/elections/voters/register/\">Ohio Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Ohio, you are required to provide your Ohio driver’s license number or Ohio state ID number. If you do not have an Ohio-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, write “none” in the ID number box.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ok",
    "registration": {
      "statusUrl": "https://oklahoma.gov/elections/ovp.html",
      "formUrl": "https://oklahoma.gov/content/dam/ok/en/elections/forms/voter-registration-application.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://oklahoma.gov/elections/voter-registration/register-to-vote.html",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Oklahoma, you are required to provide your Oklahoma driver’s license or state ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.",
        "signatureInstructions": "To register in Oklahoma you must: <br>be a United States citizen and Oklahoma resident<br>be 18 years old or older on or before the date of the next election (you may pre-register to vote if you are 17.5 years old; you must be 18 in order to vote and your application must be approved by the County Election Board)<br>not be under judgment as an incapacitated person or a partially incapacitated person prohibited from registering to vote<br>handwrite your autograph or mark and date your voter registration application using ink. No facsimile, reproduction, typewritten or other substitute signature, autograph, or mark will be valid<br>have not been convicted of a felony, or if convicted, have fully served the sentence of court-mandated calendar days, including any term of incarceration, parole, or supervision, or completed a period of probation ordered by any court",
        "citizenInstructions": null,
        "newVoterInstructions": null
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Oklahoma, you must have an Oklahoma Driver License or state ID. You must also have a digital signature on file with Service Oklahoma. The name and address on your ID must match your voter registration exactly. If you don't have an Oklahoma-issued ID or a digital signature on file with Service Oklahoma, you can still submit a voter registration application by mail.",
        "url": "https://okvoterportal.okelections.gov/Home/RegWizard"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://oklahoma.gov/elections/voter-registration/register-to-vote.html"
      },
      "parties": [
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Oklahoma online voter registration system, you are required to provide your Oklahoma driver license or state ID number. You must also have a digital signature on file with Service Oklahoma to use the online voter registration system.<br><br>If you don't have an Oklahoma-issued ID or a digital signature on file with Service Oklahoma, you can still submit a voter registration application by mail.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Oklahoma: County Election Board office; tag agency when applying for, renewing, or updating your driver's license or state ID; select public assistance agencies when applying for, updating, or renewing services",
      "byMailInstructions": "When submitting your application by mail in Oklahoma, you are required to provide your Oklahoma driver’s license or state ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P17Y6M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:or",
    "registration": {
      "statusUrl": "https://sos.oregon.gov/voting/Pages/myvote.aspx?lang=en",
      "formUrl": "https://sos.oregon.gov/elections/Documents/SEL500.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sos.oregon.gov/elections/Pages/voteinor.aspx",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Oregon, you are required to provide your valid Oregon driver's license, permit, or ID number. If you do not have an Oregon-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate NONE and include a copy of ONE of the following with your application: valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address; proof of eligibility under the Uniformed and Overseas Citizens Absentee Voting Act (UOCAVA) or the Voting Accessibility for the Elderly and Handicapped Act (VAEH)",
        "signatureInstructions": "To register in Oregon you must: <br>be a United States citizen <br>be an Oregon resident<br>be at least 16 years old to register, and 18 years old by Election Day to vote",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes:<br>current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address.<br>More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Oregon, you need to provide ONE of the following: Oregon driver’s license, Oregon permit number, OR ID card number issued by the Oregon Driver and Motor Vehicle Services Division (DMV). If you don’t have an Oregon-issued ID, you can still use the online voter registration application to generate a PDF form that you must print, sign, and return to your county elections office by mail or in person.",
        "url": "https://sos.oregon.gov/voting/Pages/registration.aspx?lang=en"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sos.oregon.gov/elections/Pages/voteinor.aspx"
      },
      "parties": [
        {
          "partyLabelEn": "We The People",
          "partyLabelEs": "Nosotros, el Pueblo",
          "partyPhrasingEn": "We The People Party",
          "partyPhrasingEs": "Partido Nosotros, el Pueblo"
        },
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Independent",
          "partyLabelEs": "Independiente",
          "partyPhrasingEn": "Independent Party",
          "partyPhrasingEs": "Partido Independiente"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "No Labels",
          "partyLabelEs": "Sin Etiquetas",
          "partyPhrasingEn": "No Labels Party",
          "partyPhrasingEs": "Partido Sin Etiquetas"
        },
        {
          "partyLabelEn": "Pacific Green",
          "partyLabelEs": "Verde Pacífico",
          "partyPhrasingEn": "Pacific Green Party",
          "partyPhrasingEs": "Partido Verde Pacífico"
        },
        {
          "partyLabelEn": "Progressive",
          "partyLabelEs": "Progresista",
          "partyPhrasingEn": "Progressive Party",
          "partyPhrasingEs": "Partido Progresista"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Working Families",
          "partyLabelEs": "Familias Trabajadoras",
          "partyPhrasingEn": "Working Families Party",
          "partyPhrasingEs": "Partido de las Familias Trabajadoras"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Oregon online voter registration system, you are required to provide ONE of the following: Oregon driver’s license or permit number; ID card number issued by the Oregon Driver and Motor Vehicle Services Division (DMV)<br><br>If you don’t have an Oregon-issued ID, you can still use the online voter registration application to generate a PDF form that you must print, sign, and return to your county elections office by mail or in person.",
      "inPersonInstructions": "If eligible, you will be automatically registered to vote when you apply for, renew, or replace an Oregon driver’s license, ID card, or permit at the DMV, unless you choose to opt-out. You can also complete a voter registration application in person at your county elections office.",
      "byMailInstructions": "When submitting your application by mail in Oregon, you are required to provide your valid Oregon driver's license, permit, or ID number. If you do not have an Oregon-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following with your application: valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address; proof of eligibility under the Uniformed and Overseas Citizens Absentee Voting Act (UOCAVA) or the Voting Accessibility for the Elderly and Handicapped Act (VAEH)",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unavailable",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:pa",
    "registration": {
      "statusUrl": "https://www.pavoterservices.pa.gov/pages/voterregistrationstatus.aspx",
      "formUrl": "https://www.pa.gov/content/dam/copapwp-pagov/en/vote/resources/documents-and-forms/2024-simplified-voter-reg-application.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.pa.gov/services/vote/register-to-vote",
        "forms": "nvrf",
        "raceFieldRequired": ":requested",
        "raceFieldInstructions": "You are requested by the Federal Voting Rights Act to fill in this box.",
        "idInstructions": "When submitting your application by mail in Pennsylvania, you are required to provide your Pennsylvania driver’s license number or PennDOT ID number if you have one. If you have not been issued a Pennsylvania ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate that you do not have an ID number.",
        "signatureInstructions": "To register in Pennsylvania you must: <br>be a United States citizen for at least one month before the next election <br>be a resident of Pennsylvania and your election district for at least 30 days before the election <br>be at least 18 years of age on the day of the next election",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Pennsylvania, you need to provide your Pennsylvania driver’s license number or PennDOT ID card number. If you do not have a Pennsylvania-issued ID, you need to provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate you do not have an ID number. To complete the online voter registration application without a PennDOT ID number, you must upload a digital image of your signature. You can also request and sign a signature form from the Department of State or print and sign a voter registration application. Both the signature form and the printed registration application must be returned to your county elections office by mail or in person. If you don’t have an ID number and do not upload an image of your signature, you can still submit a voter registration application by mail.",
        "url": "https://www.pavoterservices.pa.gov/Pages/VoterRegistrationApplication.aspx"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.pa.gov/services/vote/register-to-vote"
      },
      "parties": [
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Pennsylvania online voter registration system, you are required to provide your Pennsylvania driver’s license number or PennDOT ID card number. If you do not have a Pennsylvania-issued ID, you are required to provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. To complete the online voter registration application without a PennDOT ID number, you must upload a digital image of your signature. You can also request and sign a signature form from the Department of State or print and sign a voter registration application. Both the signature form and the printed registration application must be returned to your county elections office by mail or in person. <br><br>If you don’t have an ID number and do not upload an image of your signature, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Pennsylvania: county voter registration office; Pennsylvania Department of Transportation (PennDOT) photo or driver’s license center when obtaining or updating your driver's license<br><br>You can also find a list of locations that provide voter registration services at <a href=\"https://www.pa.gov/services/vote/register-to-vote.html\">vote.pa.gov</a>.",
      "byMailInstructions": "When submitting your application by mail in Pennsylvania, you are required to provide your Pennsylvania driver’s license number or PennDOT ID card number. If you do not have a Pennsylvania-issued ID, you are required to provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, indicate that you do not have an ID number.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next primary, special, municipal, or general election",
      "eligibilityByElection": {
        "date": "2026-05-19",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ri",
    "registration": {
      "statusUrl": "https://vote.sos.ri.gov/Home/UpdateVoterRecord?ActiveFlag=0",
      "formUrl": "https://vote.sos.ri.gov/Forms/elections/Forms/VoterRegFormEng.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://vote.sos.ri.gov/Voter/RegisterToVote",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "You are required to provide your Rhode Island DMV-issued driver’s license or State ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, the State of Rhode Island will assign a unique identifying number to you.",
        "signatureInstructions": "To register in Rhode Island you must: <br>be a United States citizen <br>be a resident of Rhode Island and of the city or town where you wish to vote at least 30 days before the next election<br>be at least 16 years of age (you must be at least 18 years old on or before a general or special election to vote)<br>not currently be incarcerated in a correctional facility due to a felony conviction <br>not have been lawfully judged to be mentally incompetent",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration form, federal law requires you to show proof of identification the first time you vote. You will also be asked to provide proof of identity that meets state law. Visit the <a href=\"https://vote.sos.ri.gov/Forms/elections/Forms/VoterIDEng.pdf\">Rhode Island Department of State Elections Division</a> website to learn more."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Rhode Island, you need to provide your Rhode Island DMV-issued driver’s license or State ID number. If you don’t have a Rhode Island-issued ID, you can still submit a voter registration form by mail.",
        "url": "https://vote.sos.ri.gov/Home/RegistertoVote?ActiveFlag=1"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://vote.sos.ri.gov/Voter/RegisterToVote"
      },
      "parties": [
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Rhode Island online voter registration system, you are required to provide your Rhode Island DMV-issued driver’s license or State ID number. If you don’t have a Rhode Island-issued ID, you can still submit a voter registration form by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration form in person at any Rhode Island Division of Motor Vehicles (DMV) office while completing DMV forms. If you are eligible to register to vote, you are automatically registered to vote while completing DMV forms unless you opt out.<br><br>You can also download a voter registration form and bring the completed form to your local board of canvassers.",
      "byMailInstructions": "When submitting your form by mail in Rhode Island, you are required to provide your Rhode Island DMV issued driver’s license or State ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:sc",
    "registration": {
      "statusUrl": "https://vrems.scvotes.sc.gov/Voter/Login?PageMode=VoterInformation",
      "formUrl": "https://scvotes.gov/wp-content/uploads/2023/08/SEC-FRM-1301-202305-VR-by-Mail-web-1.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://scvotes.gov/voters/register-to-vote/",
        "forms": "nvrf",
        "raceFieldRequired": ":required",
        "raceFieldInstructions": "You are required to fill in this box. Your application may be rejected if you fail to do so.",
        "idInstructions": "When submitting your application by mail in South Carolina, you are required to provide at least the last four digits of your Social Security number and a copy of ONE of the following forms of ID: current valid photo ID; current utility bill, bank statement, paycheck or other government document that shows your name and address in the county where you register to vote<br> <br>If you do not provide a copy of proof of ID, you will be required to provide it before voting.<br><br>You are exempt from the ID requirement when submitting a voter registration application by mail if you: are 65 years old or older; have a disability; are a member of the US Uniformed Services or Merchant Marines or their family; are a US citizens residing outside the US",
        "signatureInstructions": "To register in South Carolina you must: <br>be a United States citizen<br>be at least 18 years old on or before the next election<br>be a resident of South Carolina in the county and precinct in which you are registering<br>claim the address on your voter registration application as your only legal place of residence and claim no other place as your legal residence<br>not be under a court order declaring you mentally incompetent<br>not be confined in any public prison resulting from a conviction of a crime<br>never have been convicted of a felony or offense against the election laws OR if previously convicted, have served the entire sentence, including probation or parole, or have received a pardon for the conviction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering for the first time in this county, you must submit a copy of proof of identification with this application. Proof of identification includes: current valid photo ID, current utility bill, current bank statement, current paycheck, or other current government document that shows your name and address in this county. If you do not provide this identification with your application, you will be required to provide it before voting. Voters who are age 65 and over, voters with disabilities, members of the U.S. Uniformed Services or Merchant Marines and their families, and U.S. Citizens residing outside the U.S. are exempt from this requirement."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in South Carolina, you need a Social Security number and either a South Carolina driver’s license or a South Carolina Department of Motor Vehicles (SCDMV) ID. If you don’t have a South Carolina-issued ID, you can still register by mail.",
        "url": "https://vrems.scvotes.sc.gov/ovr/start"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://scvotes.gov/voters/register-to-vote/"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the South Carolina online voter registration system, you are required to provide your Social Security number and ONE of the following ID numbers: South Carolina driver’s license; South Carolina Department of Motor Vehicles (SCDMV) ID<br><br>If you don’t have a South Carolina-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in South Carolina: county board of voter registration; Department of Motor Vehicles<br><br>You can also find a list of locations that provide voter registration services at <a href=\"https://scvotes.gov/voters/register-to-vote/\">scvotes.gov</a>.",
      "byMailInstructions": "When submitting your application by mail in South Carolina, you are required to provide at least the last four digits of your Social Security number and a copy of ONE of the following forms of ID: current valid photo ID; current utility bill, bank statement, paycheck or other government document that shows your name and address in the county where you register to vote<br> <br>If you do not provide a copy of proof of ID, you will be required to provide it before voting.<br><br>You are exempt from the ID requirement when submitting a voter registration application by mail if you: are 65 years old or older; have a disability; are a member of the US Uniformed Services or Merchant Marines or their family; are a US citizens residing outside the US",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:sd",
    "registration": {
      "statusUrl": "https://vip.sdsos.gov/viplogin.aspx",
      "formUrl": "https://sdsos.gov/elections-voting/assets/VoterRegistrationFormFillable.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sdsos.gov/elections-voting/voting/register-to-vote/default.aspx",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in South Dakota, you are required to provide your South Dakota Driver License number or South Dakota Non-Driver ID number. If you do not have a South Dakota-issued ID, you are required to provide the last four digits of your Social Security number. If you have not been issued any of these numbers, you can still visit your county auditor's office and complete your voter registration in person.  You will you will be asked to sign a statement verifying the fact that you do not have a valid South Dakota driver license, a South Dakota non-driver identification number, or a Social Security number.",
        "signatureInstructions": "To register in South Dakota you must: <br>be a United States citizen<br>be a resident of South Dakota for at least thirty days prior to submitting the registration form<br>be at least 18 years old on or before the next election<br>not have been judged mentally incompetent by a court<br>not be currently serving a sentence for a felony conviction which included imprisonment, served or suspended, in an adult penitentiary system <br>You can find more information on voting rights restoration <a href=\"https://sdsos.gov/elections-voting/voting/register-to-vote/felony-convictions.aspx\">here</a>.",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes a current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sdsos.gov/elections-voting/voting/register-to-vote/default.aspx"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in South Dakota: county auditor's office; driver's license station<br><br>You can find a list of locations that provide voter registration services on the <a href=\"https://sdsos.gov/elections-voting/voting/register-to-vote/default.aspx\">South Dakota Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in South Dakota, you are required to provide your South Dakota Driver License number or South Dakota Non-Driver ID number. If you do not have a South Dakota-issued ID, you are required to provide the last four digits of your Social Security number.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:tn",
    "registration": {
      "statusUrl": "https://tnmap.tn.gov/voterlookup/",
      "formUrl": "https://sos-tn-gov-files.tnsosfiles.com/forms/ss-3010.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sos.tn.gov/elections/guides/how-to-register-to-vote",
        "forms": "nvrf",
        "raceFieldRequired": ":optional",
        "raceFieldInstructions": "Optional.",
        "idInstructions": "When submitting your application by mail in Tennessee, you are required to provide your full Social Security number, if you have one.",
        "signatureInstructions": "To register in Tennessee you must: <br>be a United States citizen<br>be a Tennessee resident<br>be at least 18 years old on or before the next election <br>not have been convicted of a felony, but if convicted, your eligibility to register and vote depends upon the crime you were convicted of and the date of your conviction. If your conviction has been expunged, you are not considered to have a felony conviction<br><em>You can find more information on voting rights restoration <a href=\"https://sos.tn.gov/elections/guides/restoration-of-voting-rights\">here</a></em>",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing a registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification for voter registration includes: current and valid photo identification or a current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Tennessee, you need your Social Security number and ONE of the following: Tennessee driver's license or Tennessee Department of Safety and Homeland Security ID. If you submit a voter registration application online and are registering for the first time in your county, you must vote in person the first time after registering. If you enrolled in the Safe At Home program or permanent absentee voting, you are not required to vote in person for the first time.",
        "url": "https://ovr.govote.tn.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sos.tn.gov/elections/guides/how-to-register-to-vote"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Tennessee online voter registration system, you need your Social Security number and ONE of the following ID numbers: Tennessee driver's license; Tennessee Department of Safety and Homeland Security ID<br><br>If you submit a voter registration application online, you must vote in person the first time after registering.<br><br>If you don’t have a Tennessee-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can obtain a voter registration application in person at any of the following public agencies in Tennessee: County Election Commission; County Clerk; Public Libraries; Department of Safety (motor vehicles division)<br><br>You can find a list of locations that provide voter registration services and applications on the <a href=\"https://sos.tn.gov/elections/guides/how-to-register-to-vote\">Tennessee Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Tennessee, you are required to provide your Social Security number. If you submit a voter registration application by mail, you must vote in person the first time after registering.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-08-06",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:tx",
    "registration": {
      "statusUrl": "https://goelect.txelections.civixapps.com/ivis-mvp-ui/#/login",
      "formUrl": "https://www.sos.state.tx.us/elections/forms/pol-sub/21-1f.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.votetexas.gov/register-to-vote/update-voter-registration.html",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "You must provide your Texas driver's license number or Texas personal ID number to register to vote. If you do not have a Texas driver's license or personal ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate NONE. A unique identifying number will instead be assigned to you by your State.",
        "signatureInstructions": "To register in Texas you must: <br>be a United States citizen<br>be a resident of the county where you submit your application<br>be at least 17 years and 10 months old (you must be 18 to vote) <br>have not been convicted of a felony or, if you have been convicted of a felony, you have completed your sentence, probation, and parole<br>have not been declared by a court exercising probate jurisdiction to be either totally mentally incapacitated or partially mentally incapacitated without the right to vote",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.votetexas.gov/register-to-vote/update-voter-registration.html"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your county’s Voter Registrar office in Texas.",
      "byMailInstructions": "When submitting your application by mail in Texas, you are required to provide your Texas driver’s license number or Texas personal identification (ID) number, if you have one.<br><br>If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P17Y10M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:ut",
    "registration": {
      "statusUrl": "https://votesearch.utah.gov/voter-search/search/search-by-voter/voter-info",
      "formUrl": "https://vote.utah.gov/wp-content/uploads/2024/01/State-of-Utah-Voter-Registration-Form.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://vote.utah.gov/learn-about-registering-to-vote/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Your completed voter registration form must contain your Utah Driver License number or your Utah State Identification number if you have one. If you do not have a Utah Driver License or a Utah State Identification card, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, indicate NONE.",
        "signatureInstructions": "To register in Utah you must: <br>be a citizen of the United States <br>have resided in Utah for 30 days immediately before the next election <br>be at least 18 years old on or before the next election (individuals who are 16 and 17 years of age may pre-register to vote; if a 17 year old will be 18 years of age on or before the upcoming general election, they may pre-register and vote in the primary election)<br>not be convicted of a felony and currently incarcerated<br>not be convicted of treason or crime against the elective franchise, unless restored to civil rights<br>currently resides within the voting district or precinct in which you register to vote",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR two forms of ID that, when combined, prove your name and current residence (bank statements, paycheck, current utility bill). More information on ID requirements <a href=\"https://voteinfo.utah.gov/voter-id-requirements/\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Utah, you are required to provide your valid Utah driver license number or valid Utah ID number. Your address must also match the address on file with the Driver License Division. If your driver license address is not current, you must update your address with the Driver License Division before submitting your online voter registration. If you don't have a Utah-issued ID, you can still submit a voter registration application by mail or in person.",
        "url": "https://secure.utah.gov/voterreg/index.html"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://vote.utah.gov/learn-about-registering-to-vote/"
      },
      "parties": [
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "No Labels",
          "partyLabelEs": "Sin Etiquetas",
          "partyPhrasingEn": "No Labels Party",
          "partyPhrasingEs": "Partido Sin Etiquetas"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Independent American",
          "partyLabelEs": "Independiente Estadounidense",
          "partyPhrasingEn": "Independent American Party",
          "partyPhrasingEs": "Partido Independiente Estadounidense"
        },
        {
          "partyLabelEn": "Forward",
          "partyLabelEs": "Avance",
          "partyPhrasingEn": "Forward Party",
          "partyPhrasingEs": "Partido Avance"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Green",
          "partyLabelEs": "Verde",
          "partyPhrasingEn": "Green Party",
          "partyPhrasingEs": "Partido Verde"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Utah online voter registration system, you are required to provide ONE of the following: valid Utah driver license number; valid Utah ID number<br><br>Your address must also match the address on file with the Driver License Division. If your driver license address is not current, you must update your address with the Driver License Division before submitting your online voter registration.<br><br>If you don't have a Utah-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county clerk’s office in Utah.",
      "byMailInstructions": "When submitting your application by mail in Utah, you are required to provide your Utah driver license or Utah ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:va",
    "registration": {
      "statusUrl": "https://vote.elections.virginia.gov/VoterInformation/Lookup/status",
      "formUrl": "https://www.elections.virginia.gov/media/formswarehouse/veris-voter-registration/applications/VA-NVRA-1-Voter-Registration-Application-rev-6-2025.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.elections.virginia.gov/registration/how-to-register/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Virginia, you are required to provide your full Social Security number if you have one.",
        "signatureInstructions": "To register in Virginia you must:<br>be a United States citizen<br>be a Virginia resident (if you come to Virginia for temporary purposes and intend to return to another state, you are not considered a resident for voting purposes)<br>be 18 years old (if you are 17 years old and will be 18 years years old at the next general election, you can register in advance and vote in any intervening primary or special election)<br>not be registered and plan to vote in another state<br>have your right to vote restored if convicted of a felony<br>not currently be declared mentally incompetent by a court of law",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote or provide a copy of your ID when you submit your application. Proof of identification includes current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Virginia, you need your full Social Security number and either a Virginia driver’s license or Virginia state ID number. If you don’t have a Virginia-issued ID or Social Security number, you can still register by mail or in person.",
        "url": "https://vote.elections.virginia.gov/Registration/DmvLookup"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.elections.virginia.gov/registration/how-to-register/"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Virginia online voter registration system, you are required to provide: Virginia driver’s license or state ID number; full Social Security number<br><br>If you don't have a Virginia-issued ID or Social Security number, you can submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Virginia: local voter registration office; Department of Motor Vehicles (DMV) offices; Virginia Department of Elections office<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://www.elections.virginia.gov/registration/how-to-register/\">Virginia Department of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Virginia, you are required to provide your full Social Security number if you have one. If you have not been issued a Social Security number, check the box that indicates you do not have a Social Security number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:vt",
    "registration": {
      "statusUrl": "https://vote.vermont.gov/public/dashboard",
      "formUrl": "https://outside.vermont.gov/dept/sos/Elections%20Division/voters/voterapplication.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sos.vermont.gov/elections/voters/registration/",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When registering by mail in Vermont, you need to provide your Vermont driver’s license number or Vermont personal ID (PID) number. If you do not have a Vermont-issued ID, you must provide the last four digits of your Social Security number. If you do not have a Vermont-issued ID or Social Security number, indicate NONE on the form. The Secretary of State's office will assign you a unique identifying number.",
        "signatureInstructions": "To register in Vermont you must:<br>be a United States citizen<br>be a Vermont resident<br>be at least 18 years old on or before Election Day<br>attest that you have taken or affirmed the Voter's Oath when registering to vote for the first time: “You solemnly swear or affirm that whenever you give your vote or suffrage, touching any matter that concerns the State of Vermont, you will do it so as in your conscience you shall judge will most conduce to the best good of the same, as established by the Constitution, without fear or favor of any person.”",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: current and valid photo identification or current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://sos.vermont.gov/elections/voters/registration/#newvote\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Vermont, you need to provide ONE of the following ID numbers: Vermont driver’s license, Vermont permit, or Vermont ID. If you do not have a Vermont-issued ID, you must provide the last four digits of your Social Security number. If you are registering to vote in Vermont for the first time, you must include a copy of ONE form of ID. Acceptable forms include: valid driver’s license, valid US passport, current utility bill, current bank statement, or another government document containing your residential address. If you don’t have a Vermont-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
        "url": "https://olvr.vermont.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sos.vermont.gov/elections/voters/registration/"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Vermont online voter registration system, you are required to provide ONE of the following ID numbers: Vermont driver’s license; Vermont permit; Vermont ID<br><br>If you do not have a Vermont-issued ID, you must provide the last four digits of your Social Security number.<br><br>If you are registering to vote in Vermont for the first time, you must include a copy of ONE form of ID. Acceptable forms include: valid driver’s license; valid passport; current utility bill; current bank statement; another government document containing your residential address<br><br>If you don’t have a Vermont-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your town clerk’s office in Vermont.",
      "byMailInstructions": "When submitting your application by mail in Vermont, you are required to provide your Vermont driver’s license number or Vermont personal ID (PID) number. If you do not have a Vermont-issued ID, you are required to provide the last four digits of your Social Security number. <br><br>If you are registering in Vermont for the first time, you must complete the Voter’s Oath. If you do not take oaths, you may take it as an affirmation.<br><br>If you are registering to vote in Vermont for the first time, you must include a copy of ONE form of ID with your name and current residential address. Acceptable forms include: current and valid photo ID; bank statement; utility bill; government document<br><br>If you do not have a Vermont-issued ID or Social Security number, contact the <a href=\"https://sos.vermont.gov/elections/about/\">Vermont State Election Division</a>.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:wa",
    "registration": {
      "statusUrl": "https://voter.votewa.gov/portal2023/login.aspx",
      "formUrl": "https://www.sos.wa.gov/sites/default/files/2023-07/VRF_English.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://www.sos.wa.gov/elections/voters/voter-registration/register-vote-washington",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When registering by mail in Washington, you are required to provide your Washington driver license, permit, or ID number or the last four digits of your Social Security number. If you have not been issued any of these numbers, you can leave that field blank. After you submit your application, your local election office will reach out to give you instructions about using an alternate ID to complete the voter registration process.",
        "signatureInstructions": "To register in Washington you must: <br>be a United States citizen <br>be a legal resident of Washington<br>be at least 18 years old by election day (16- and 17-year-olds can sign up as Future Voters and automatically be registered to vote when they qualify)<br>not be disqualified from voting due to a court order<br>not be currently serving a sentence of total confinement in prison under the jurisdiction of the Department of Corrections for a felony conviction in Washington State, another state, or in federal court<br>not be currently incarcerated for a federal or out-of-state felony conviction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing this registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes current and valid photo identification OR current utility bill, bank statement, government check, paycheck or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Washington, you need to provide ONE of the following: Washington driver license number, Washington permit number, Washington state ID number, or the last 4 digits of your Social Security number. If you don't have a Washington-issued ID or Social Security number, you can still register by mail or in person with an alternate ID.",
        "url": "https://olvr.votewa.gov/"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://www.sos.wa.gov/elections/voters/voter-registration/register-vote-washington"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": "https://www.sos.wa.gov/elections/voters/voter-eligibility-resources/future-voter-program",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Washington online voter registration system, you are required to provide your Washington driver license number, Washington permit number, Washington state ID number, or the last 4 digits of your Social Security number.<br><br>If you don't have a Washington-issued ID, you can still submit a voter registration application by mail or in person with an alternate ID.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Washington: County Elections Offices; Department of Licensing when you get your driver's license, permit, or ID<br><br>You can also register at your school's Temperance and Good Citizenship Day event in January.",
      "byMailInstructions": "When submitting your application by mail in Washington, you are required to provide your Washington driver license, permit, or ID number or the last four digits of your Social Security number. If you have not been issued any of these numbers, you can leave that field blank. After you submit your application, your local election office will reach out to give you instructions about using an alternate ID to complete the voter registration process.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:wi",
    "registration": {
      "statusUrl": "https://myvote.wi.gov/en-us/My-Voter-Info",
      "formUrl": "https://elections.wi.gov/sites/default/files/legacy/2020-06/El-131%2520Voter%2520Registration%2520App_Fillable-%2520%2528REV%25202020-06%2529_0.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://elections.wi.gov/Register",
        "forms": "wiReg",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When registering by mail in Wisconsin, you are required to provide your valid and unexpired Wisconsin driver license or Wisconsin state ID number and the expiration date. If you have not been issued a Wisconsin ID, or if you have an expired, canceled, suspended, or revoked Wisconsin-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. You must also provide proof of residence when registering to vote. If you submit your application by mail, you must include a copy of proof of residence or submit proof of residence in an electronic format. Acceptable forms include but are not limited to: current and valid Wisconsin Driver License or State ID card or any official ID card or license issued by the Wisconsin government. When filling out a voter registration application, you must review the registration qualifications in Box 1. If you meet the requirements, check all of the boxes. If you do not meet all of the requirements, do not submit the form.",
        "signatureInstructions": "To register in Wisconsin you must: <br>be a United States citizen <br>be a Wisconsin resident and have resided at your registration address for at least 28 days prior to the election<br>be 18 years old on or before Election Day<br>not have been convicted of treason, felony or bribery, or if you have, your civil rights have been restored after completion of your sentence or a pardon <br>not have been found by a court to be incapable of understanding the objective of the electoral process <br>not make or benefit from a bet or wage depending on the result of an election <br>not have voted at any other location, if registering on Election Day",
        "citizenInstructions": null,
        "newVoterInstructions": null
      },
      "online": {
        "supported": true,
        "instructions": "To register online in Wisconsin, you are required to provide your Wisconsin driver license number or Wisconsin state ID card number issued by the Wisconsin Department of Motor Vehicles (DMV). If you don’t have a Wisconsin-issued driver license or ID card, you can still submit a voter registration application by mail or in person.",
        "url": "https://myvote.wi.gov/en-us/Register-To-Vote"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://elections.wi.gov/Register"
      },
      "parties": []
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Wisconsin online voter registration system, you are required to provide a Wisconsin driver license or Wisconsin state ID number. To complete a voter registration application online, your name, date of birth, and ID number must match what is on file with the Department of Motor Vehicles (DMV).<br><br>If you do not have a Wisconsin-issued ID, or if your voter registration address does not match the address on your ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your municipal clerk’s office in Wisconsin. <br><br>You are required to provide your valid and unexpired Wisconsin driver license or Wisconsin state ID number and expiration date. If you have not been issued a Wisconsin ID, or if you have an expired, canceled, suspended, or revoked Wisconsin-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, you will be able to indicate that.<br><br>If you are registering to vote in person, you are also required to provide proof of residence. Visit the <a href=\"https://elections.wi.gov/Register#230548828-3947500893\">Wisconsin Elections Commission</a> website to find more information and a full list of acceptable forms of proof of residence.",
      "byMailInstructions": "When submitting your application by mail in Wisconsin, you are required to provide your valid and unexpired Wisconsin driver license or Wisconsin state ID number and the expiration date. If you have not been issued a Wisconsin ID, or if you have an expired, canceled, suspended, or revoked Wisconsin-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.<br><br>You must also provide proof of residence when registering to vote. If you submit your application by mail, you must include a copy of proof of residence or submit proof of residence in an electronic format. Visit the <a href=\"https://elections.wi.gov/Register#230548828-3947500893\">Wisconsin Elections Commission</a> website to find more information and a full list of acceptable forms of proof of residence.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-04-07",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:wv",
    "registration": {
      "statusUrl": "https://apps.sos.wv.gov/Elections/Voter/FindMyPollingPlace",
      "formUrl": "https://sos.wv.gov/FormSearch/Elections/Voter/mail%20in%20voter%20registration%20application.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "online"
      ],
      "byMail": {
        "supported": true,
        "url": "https://ovr.sos.wv.gov/Register/Landing",
        "forms": "nvrf",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "Enter your West Virginia driver’s license or DMV-issued non-driver’s ID number. If you do not have a West Virginia driver’s license or DMV-issued ID, enter the last four digits of your Social Security number. If you do not have a driver’s license, DMV ID, or Social Security number, enter the word “NONE.” An ID number will be assigned to you.",
        "signatureInstructions": "To register in West Virginia you must: <br>be a United States citizen<br>live in West Virginia at the address on your application <br>be 18 years old, or to vote in the primary be 17 years old and turning 18 before the general election <br>not be under conviction, probation, or parole for a felony, treason or election bribery <br>not have been judged \"mentally incompetent\" in a court of competent jurisdiction",
        "citizenInstructions": null,
        "newVoterInstructions": "If you are registering to vote for the first time in West Virginia or for the first time in your county and you have not cast a vote in a federal election in this state, you must submit a copy of a current and valid ID with this application or show it the first time you vote. To submit with this form, include: a copy of a current and valid photo ID, a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and current residence address. More information <a href=\"https://sos.wv.gov/elections/Pages/FAQs.aspx\">here</a>."
      },
      "online": {
        "supported": true,
        "instructions": "To register online in West Virginia, you need the last four digits of your Social Security number and either a West Virginia Driver’s License or ID card. If you don’t have a West Virginia-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
        "url": "https://ovr.sos.wv.gov/Register/Landing"
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://ovr.sos.wv.gov/Register/Landing"
      },
      "parties": [
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        },
        {
          "partyLabelEn": "Mountain",
          "partyLabelEs": "Montaña",
          "partyPhrasingEn": "Mountain Party",
          "partyPhrasingEs": "Partido Montaña"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the West Virginia online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following: West Virginia driver’s license number; West Virginia ID card number<br><br>If you don’t have a West Virginia-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in West Virginia: County Clerk; Division of Motor Vehicles (DMV)<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://sos.wv.gov/elections/Pages/FAQs.aspx\">West Virginia Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in West Virginia, you are required to provide your West Virginia driver’s license or West Virginia Division of Motor Vehicles (DMV) ID number. If you have not been issued a West Virginia ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, write “none” in the ID number box.<br><br>If you are registering to vote for the first time in West Virginia or in your county and you have not cast a vote in a federal election in West Virginia, you must submit with your form a copy of a current and valid ID or show it the first time you vote. Acceptable forms include: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and current residence address",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "ocdId": "ocd-division/country:us/state:wy",
    "registration": {
      "statusUrl": null,
      "formUrl": "https://sos.wyo.gov/Forms/Elections/General/VoterRegistrationForm.pdf",
      "noRegistrationRequiredInstructions": null,
      "methods": [
        "byMail",
        "electionDay"
      ],
      "byMail": {
        "supported": true,
        "url": "https://sos.wyo.gov/elections/state/registeringtovote.aspx",
        "forms": "wyReg",
        "raceFieldRequired": null,
        "raceFieldInstructions": null,
        "idInstructions": "When submitting your application by mail in Wyoming, you must include your Wyoming driver’s license number and provide proof of identity, residence, and citizenship. Your form must also be notarized before mailing.<br><br>Acceptable forms of proof of identity AND residence include: Wyoming driver’s license; United States passport; tribal ID card issued by a federally recognized tribe<br><br>If you have not been issued any of these forms of ID, you may provide your Wyoming driver's license number or the last 4 digits of your Social Security number, along with one of the following forms of identification that can also serve as proof of residence if it lists a Wyoming address. Acceptable forms include: valid US passport; driver's license or ID card issued by the federal government, any state, or an outlying possession of the United States; photo ID card issued by the University of Wyoming, a Wyoming community college, or a Wyoming public school; military ID card; ID card issued to a dependent of a member of the United States Armed Forces; tribal ID card issued by a federally recognized tribe<br><br>If you have not been issued a Wyoming driver's license number or a Social Security number, indicate you do not have an ID number and contact your county clerk. You must provide two of the following forms of identification that can also serve as proof of residence if it lists a Wyoming address. Acceptable forms include: certificate of United States citizenship; certificate of naturalization; United States Military Draft Record or Selective Service Card or Record; voter registration card from another state or county; United States Social Security card; certificate of Birth Abroad issued by the Department of State; original or certified copy of birth certificate bearing an official seal; any form of identification issued by an official agency of the United States or a state; void Wyoming driver's license or ID card; temporary Wyoming driver's license or ID card<br><br>You can find a full list of acceptable forms of proof of identity, residence, and citizenship on the <a href=\"https://sos.wyo.gov/elections/state/registeringtovote.aspx\">Wyoming Secretary of State</a> website.",
        "signatureInstructions": "To register in Wyoming you must:<br>be at least 18 years old on Election Day<br>be a United States citizen<br>be a bona fide resident of Wyoming for at least 30 days before the next election<br>have not been convicted of a felony, or if you have, you have had civil or voting rights restored<br>not be adjudicated to be mentally incompetent<br>have withdrawn your voter registration from any other jurisdiction, if applicable",
        "citizenInstructions": "You must provide proof of citizenship when you register to vote. Your proof of citizenship cannot contain any indication that you are not a US citizen. Acceptable forms include: Wyoming driver's license or ID card; tribal ID card issued by the governing body of the Eastern Shoshone Tribe or the Northern Arapaho Tribe of the Wind River Indian Reservation or any other federally recognized tribe; valid driver's license or ID card issued by any other state that is consistent with the Real ID Act; US passport; certificate of US citizenship; certificate of naturalization; US military draft record or a selective service registration acknowledgement card; consular report of birth abroad issued by the US Department of State; or original or certified copy of a birth certificate in the United States bearing an official seal.",
        "newVoterInstructions": "If you are registering to vote for the first time in your jurisdiction and are mailing your registration application, federal law requires you to show proof of identification the first time you vote. Proof of identification includes: a current and valid photo identification or a current utility bill, bank statement, government check, paycheck, or government document that shows your name and address. More information <a href=\"https://www.eac.gov/sites/default/files/eac_assets/1/6/Federal_Voter_Registration_ENG.pdf\">here</a>."
      },
      "online": {
        "supported": false,
        "instructions": null,
        "url": null
      },
      "inPerson": {
        "supported": false,
        "electionDayInstructions": null,
        "advanceUrl": "https://sos.wyo.gov/elections/state/registeringtovote.aspx"
      },
      "parties": [
        {
          "partyLabelEn": "Constitution",
          "partyLabelEs": "Constitucional",
          "partyPhrasingEn": "Constitution Party",
          "partyPhrasingEs": "Partido Constitucional"
        },
        {
          "partyLabelEn": "Libertarian",
          "partyLabelEs": "Libertario",
          "partyPhrasingEn": "Libertarian Party",
          "partyPhrasingEs": "Partido Libertario"
        },
        {
          "partyLabelEn": "Democratic",
          "partyLabelEs": "Demócrata",
          "partyPhrasingEn": "Democratic Party",
          "partyPhrasingEs": "Partido Demócrata"
        },
        {
          "partyLabelEn": "Republican",
          "partyLabelEs": "Republicano",
          "partyPhrasingEn": "Republican Party",
          "partyPhrasingEs": "Partido Republicano"
        }
      ]
    },
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your county clerk’s office and certain public agencies in your county in Wyoming. You can look up your <a href=\"https://sos.wyo.gov/Elections/Docs/WYCountyClerks.pdf\">county clerk’s</a> website and find locations that offer in-person voter registration services.<br><br>If you are registering to vote in person, you must provide proof of identity, residence, and citizenship. <br><br>You can find a full list of acceptable forms of proof of identity, residence, and citizenship on the <a href=\"https://sos.wyo.gov/elections/state/registeringtovote.aspx\">Wyoming Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Wyoming, you are required to provide your Wyoming driver’s license number and provide proof of identity, residence, and citizenship. Your form must also be notarized before mailing.<br><br>Acceptable forms of proof of identity AND residence include: Wyoming driver’s license; United States passport; tribal ID card issued by a federally recognized tribe<br><br><br>If you have not been issued one of these forms of ID, you may provide your Wyoming driver's license number or the last 4 digits of your Social Security number, along with additional proof of identity. You can find a full list of acceptable forms of proof of identity on the <a href=\"https://sos.wyo.gov/elections/state/registeringtovote.aspx\">Wyoming Secretary of State’s</a> website.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and contact your county clerk.<br><br>You must provide proof of citizenship when you register to vote. Your proof of citizenship cannot contain any indication that you are not a US citizen. Acceptable forms include but are not limited to: Wyoming driver's license or ID card; US passport; Valid driver's license or ID card issued by any other state that is consistent with the Real ID Act<br><br>You can find a full list of acceptable forms of proof of citizenship on the <a href=\"https://sos.wyo.gov/elections/state/registeringtovote.aspx\">Wyoming Secretary of State’s</a> website.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": false
      }
    }
  }
]