[
  {
    "state": "DC",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the District of Columbia online voter registration system, you are required to provide your District of Columbia Department of Motor Vehicles-issued ID number. If you do not have a DC DMV-issued ID, you must provide the last four digits of your Social Security Number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>If you are registering to vote in the District of Columbia for the first time and submit a voter registration application electronically, you may be required to provide identification that shows your name and current address the first time you vote in an election. You may attach a copy of your document to the online form, or you may be required to show it the first time you vote in an election in the District of Columbia. Acceptable forms include: current and valid government-issued photo ID; current utility bill, cell phone bill, bank statement, government check, or paycheck dated no more than 90 days before submitting your application if a copy is submitted online or 90 days before voting if shown at a voting location; any other government-issued document",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in the District of Columbia: District of Columbia Board of Elections office; any voter registration agency<br><br>If you are registering to vote in person, you are required to provide proof of residence that shows your name and current DC address.<br><br>Acceptable forms include: copy of a current and valid government-issued photo identification; utility bill for water, gas, electricity, cable, internet, telephone or cellular phone service issued no earlier than 90 days before the election in which you plan to vote; savings, checking, credit, or money market account statement from a bank or credit union issued no earlier than 90 days before the election in which you plan to vote; government-issued document or check from a federal or District agency, other than the Board of Elections, issued no earlier than 90 days before the election in which you plan to vote; current residential lease or rental agreement; occupancy statement from a District homeless shelter issued no earlier than 90 days before the election in which you plan to vote; tuition or housing bill from a District of Columbia college or university issued for the current academic or housing term",
      "byMailInstructions": "When submitting your application by mail in the District of Columbia, you are required to provide your District of Columbia Department of Motor Vehicles-issued ID number. If you do not have a DC DMV-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>If you are registering to vote in the District of Columbia for the first time, you may be required to provide identification that shows your name and current address the first time you vote in an election. Acceptable forms include: current and valid government-issued photo ID; current utility bill, cell phone bill, bank statement, government check, or paycheck dated no more than 90 days before submitting your application if a copy is submitted online or 90 days before voting if shown at a voting location; any other government-issued document",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "AK",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Alaska online voter registration system, you are required to provide your Social Security number and ONE of the following ID numbers: Alaska driver’s license; Alaska state ID<br>If you don’t have an Alaska-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Alaska: Division of Elections Offices; Division of Motor Vehicles (DMV) Offices; participating public libraries<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://www.elections.alaska.gov/Core/wheretoregister.php\">Alaska Division of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Alaska, you are required to provide ONE of the following ID numbers: Alaska driver’s license; Alaska state ID; last four digits of your Social Security number<br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br>If you submit a voter registration application by mail and you are not already registered to vote in Alaska, you must provide proof of identity. You may include a copy of your proof of identity with your application, or you must verify your identity the first time you vote. Acceptable forms include: driver’s license; state ID card; US passport; current and valid photo identification; birth certificate; Hunting and Fishing license",
      "eligibilityAge": "P17Y275D",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "AL",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Alabama online voter registration system, you are required to provide ONE of the following valid ID numbers: Alabama Driver's License; Alabama Non-Driver's Identification card<br><br>If you don’t have an Alabama-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your local County Board of Registrars in Alabama. <br><br>You can also obtain a voter registration application in person at any of the following public agencies in Alabama: driver's licensing office; county and select municipal public libraries; public four-year universities and select private four-year universities<br><br>You can find a list of locations that provide voter registration services and voter registration application on the <a href=\"https://www.sos.alabama.gov/alabama-votes/voter-registration/general-info\">Alabama Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Alabama, you are required to provide your Alabama Driver’s License number or Alabama Non-Driver ID number. If you do not have one, you are required to provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. You may send with your application a copy of your valid photo ID.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-05-19",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "AR",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can obtain a voter registration application in person at any of the following public agencies in Arkansas: local county clerk; revenue or DMV office; public library<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://www.sos.arkansas.gov/elections/voter-information/voter-registration-information\">Arkansas Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting a registration application by mail in Arkansas, you are required to provide your Arkansas driver’s license number. If you have not been issued an Arkansas driver’s license number, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>If you are registering to vote for the first time and you do not include an ID number on your mail-in application, you must submit with your form a copy of ONE of the following forms of ID: current and valid photo identification; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address<br><br>If you do not include a copy of your ID, you will be required to provide additional identification when voting for the first time.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-03-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "AZ",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Arizona online voter registration system, you are required to provide ONE of the following ID numbers issued by the Motor Vehicle Division (MVD): Arizona Driver License; Arizona non-operating ID<br><br>If you don’t have an Arizona MVD-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your County Recorder’s office in Arizona.",
      "byMailInstructions": "When submitting your application by mail in Arizona, you are required to provide ONE of the following ID numbers: Arizona Driver License; ;Arizona non-operating ID; last four digits of Social Security number; tribal ID; alien registration, naturalization certificate, or citizenship certificate<br><br>You must submit proof of citizenship with your registration form to vote a full ballot that includes all federal, state, county, and local races and ballot questions for which you are eligible. Your Arizona driver’s license number will serve as proof of citizenship if it was issued after October 1, 1996, AND it was issued after you became a US citizen. You can find a full list of forms of proof of citizenship on the <a href=\"https://azsos.gov/elections/voters#regreq\">Arizona Secretary of State’s</a> website.<br><br>If you do not provide proof of citizenship or proof of citizenship cannot be acquired from the Arizona Motor Vehicle Division, your ballot will only include federal races.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next regular general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "state": "CA",
    "youthRegistration": {
      "url": "https://www.sos.ca.gov/elections/pre-register-16-vote-18/pre-reg-faqs",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the California online voter registration system, you are required to provide: California-issued driver license or California identification card number; last four digits of your Social Security number; consent to the use of your DMV-stored digital signature to use California’s online voter registration system<br><br>If you don't have a California-issued ID or don't want to provide consent for the use of your digital signature, you can use the California Online Voter Registration system to fill out an application. You must then print the form or request that your local election office print and mail the form to you. The printed form must be completed and returned to your local election office by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any California Department of Motor Vehicles (DMV) office while applying for a driver license or identification card or changing your address with the DMV. <br><br>You can also pick up a voter registration application, fill out the form completely, and return it at your county elections office. You can find a list of locations that provide voter registration applications on the <a href=\"https://www.sos.ca.gov/elections/pre-register-16-vote-18/pre-reg-faqs\">California Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in California, you are required to provide your date of birth and U.S. state or foreign country of birth and the following if you have them: California-issued driver license or California identification card number; last four digits of your Social Security number",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "CO",
    "youthRegistration": {
      "url": "https://www.sos.state.co.us/pubs/elections/highSchoolRegistration.html",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Colorado online voter registration system, you are required to provide at least ONE of the following: Colorado driver’s license number; Colorado ID card number; last four digits of your Social Security number<br><br>If you don’t have a Colorado Driver’s License, Colorado ID card, or Social Security number, you can still submit a voter registration application in person or by mail.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Colorado: Colorado Department of Motor Vehicle office when you apply for a driver's license or when updating your driver's license information; Colorado public high schools; county clerk and recorder’s office<br><br>You can also complete a voter registration application in person at any office that provides voter registration services and applications. You can find a full list on the <a href=\"https://www.coloradosos.gov/pubs/elections/FAQs/VoterRegistrationFAQ.html\">Colorado Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Colorado, you are required to provide your Colorado driver’s license number or Colorado ID card number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, indicate NONE. You may be required to provide an acceptable form of ID the first time you vote in an election in Colorado. You can find a full list of acceptable forms of ID on the <a href=\"https://www.coloradosos.gov/pubs/elections/vote/acceptableFormsOfID.html\">Colorado Secretary of State</a> website.",
      "eligibilityAge": "P15Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "CT",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Connecticut online voter registration system, you are required to provide a current and valid ID number issued by the Connecticut Department of Motor Vehicles (DMV). Acceptable ID numbers include: Connecticut driver’s license; Connecticut learner’s permit; Connecticut non-driver photo ID<br><br>If you don’t have a CT DMV-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Connecticut: town clerk; town registrar; Connecticut Department of Motor Vehicles (when receiving driver’s license, learner’s permit, or non-driver identification card service)",
      "byMailInstructions": "When submitting a registration application by mail in Connecticut, you are required to provide your Connecticut driver’s license number. If you have not been issued a Connecticut driver’s license number, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, leave that field blank. <br><br>If it is your first time registering, you are submitting your application by mail, and you do not include an ID number, you may wish to submit a copy of one form of identification so that you avoid additional ID requirements when you vote for the first time. Acceptable forms include: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or government document that shows your name and address",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next regular election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "DE",
    "youthRegistration": {
      "url": "https://dmv.de.gov/DriverServices/other/index.shtml?dc=dr_oth_vote",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register online in Delaware, you must be at least 18 years old on or before the next general election.<br><br>You are required to provide ONE of the following when registering online: Delaware driver's license number; Delaware State ID number; last four digits of your Social Security number",
      "inPersonInstructions": "You can complete a voter registration application in person if you are at least 16 years old. You can register at the Division of Motor Vehicles (DMV) when obtaining a driver’s license.",
      "byMailInstructions": "You must be at least 18 years old on or before the next general election to submit a voter registration application by mail in Delaware.<br><br>When submitting your application by mail in Delaware, you are required to provide your Delaware driver’s license number or Delaware State ID number. If you do not have a Delaware-issued ID, you are required to provide the last four digits of your Social Security number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "FL",
    "youthRegistration": {
      "url": "https://registertovoteflorida.gov/home",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Florida online voter registration system, you are required to provide the last four digits of your Social Security number and the issued date and ID number from ONE of the following: Florida driver license; Florida identification card issued by the Florida Department of Highway Safety and Motor Vehicles<br><br>If you don’t have any of the above, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Florida: Florida driver license office; public libraries; any office that provides public assistance<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://dos.fl.gov/elections/for-voters/voter-registration/national-voter-registration-act/\">Florida Division of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Florida, you are required to provide your current and valid Florida driver’s license number or Florida identification card number, if you have one. If you do not have a Florida driver’s license or state ID, you are required to include the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: ID that shows your name and photo (includes US passport, debit or credit card, and student ID); ID that shows your name and current residence address (includes bank statement, government check, paycheck, or other government document) <br><br>You can find a full list of acceptable forms of ID on the <a href=\"https://files.floridados.gov/media/704789/1s-2040-form-ds-de-39-eng-fillable-20250805.pdf\">Florida statewide voter registration application</a>.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "GA",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Georgia online voter registration system, you are required to provide an identification (ID) number from ONE of the following: valid Georgia driver’s license; ID card issued by the Georgia Department of Driver Services (DDS)<br><br>If you don’t have a Georgia driver’s license or ID card issued by DDS, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any Georgia Department of Driver Services (DDS) office while applying for a driver license or identification card or changing your address with the DDS. <br><br>You can obtain a voter registration application in person at any of the following public agencies in Georgia: Department of Driver Services office when applying for or renewing your driver’s license or ID card; county board of registrars or election office; public library<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://sos.ga.gov/how-to-guide/how-guide-registering-vote\">Georgia Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Georgia, you are required to provide ONE of the following: Georgia driver’s license number; Georgia state-issued ID number; last four digits of your Social Security number<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. <br><br>You are also required to provide a copy of proof of residence if you are registering for the first time and submitting your application by mail. Acceptable forms of proof of residence include: current and valid photo ID; utility bill, bank statement, government check, paycheck, or other government document that shows your name and address",
      "eligibilityAge": "P17Y6M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "HI",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Hawaii online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following: Hawaii Driver License number; Hawaii State ID card number<br><br>If you don’t have a Social Security number or a Hawaii-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can apply to register to vote in Hawaii at the Department of Motor Vehicles when you complete a driver license or State ID application. You can also complete a voter registration application in person at any of the following public agencies in Hawaii: Hawaii Office of Elections; County Elections Divisions; State Libraries<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://elections.hawaii.gov/register-to-vote/registration/\">Hawaii Office of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Hawaii, you are required to provide your Hawaii Driver License number or Hawaii state identification (ID) number, if you have one. <br><br>If you do not have a Hawaii Driver License or State ID, you are required to include the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "IA",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Iowa online voter registration system, you are required to provide to last five digits of your Social Security number and ONE of the following ID numbers: Iowa driver’s license; Iowa non-operators ID<br><br>If you have not been issued a Social Security number or Iowa ID number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county auditor’s office in Iowa. <br><br>If you are submitting a voter registration application in person, you are required to provide ONE of the following: Iowa driver’s license number; Iowa non-operators ID number; Last four digits of your Social Security number<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "byMailInstructions": "When submitting your application by mail in Iowa, you are required to provide ONE of the following: Iowa driver’s license number; Iowa non-operators ID number; last four digits of your Social Security number<br><br>If you have not been issued any of these numbers, indicate you do not have an ID number.<br><br>You must sign the form before returning it to your county auditor. If you are not physically able to sign the form, you may use a rubber stamp or mark that you use regularly, or you may ask someone to sign your name as long as the person is with you when signing the form at your request.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "ID",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Idaho online voter registration system, you are required to provide a current and valid ID number issued by the Idaho Department of Motor Vehicle (DMV): Driver’s License; DMV Identification Card<br><br>If your residence does not match the address on your ID, you are required to provide proof of residence to your county elections office or at the polls when you vote in person. You can find a list of approved proof of residence documents and more information at <a href=\"https://voteidaho.gov/voter-registration/\">VoteIdaho.gov</a>.<br><br>If you don’t have an Idaho DMV-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your County Clerk’s office in Idaho.<br><br>If you are registering in person, you are required to provide ONE of the following forms of proof of identity: Idaho Driver’s License; Idaho Identification Card; US passport or federal ID; Tribal ID Card<br><br>You must also show proof of residence when completing a voter registration application in person. Acceptable forms of proof of residence include, but are not limited to, forms of proof of identity if they include the name and address you use to register. <br><br>You can find a full list of approved proof of residence documents and more information at <a href=\"https://voteidaho.gov/voter-registration/\">VoteIdaho.gov</a>.",
      "byMailInstructions": "When submitting your application by mail in Idaho, you are required to provide your Idaho Driver’s License number.<br><br>If you have not been issued an Idaho Driver’s License number, you must provide the last four digits of your Social Security number.<br><br>You must also provide a copy of proof of residence with your voter registration application. Your proof of residency document must include the current name and address you use to register to vote. Acceptable forms include but are not limited to: Idaho Driver’s License; Idaho ID card; Passport or Federal ID; Tribal ID; Enrollment letter from an Idaho high school or university<br><br>You can find a full list of approved proof of residence documents and more information at <a href=\"https://voteidaho.gov/voter-registration/\">VoteIdaho.gov</a>.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "IL",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Illinois online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following ID numbers with its expiration date: Illinois Drivers License; Illinois State ID number<br><br>If you don’t have an Illinois-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You must be at least 17 years old and you must be 18 on or before the next General or Consolidated Election to submit a voter registration application in person in Illinois. You can complete a voter registration application in person at any of the following public agencies in Illinois: County Clerk's Office; schools; public Libraries<br><br>You can find a full list of locations where voter registration is available on the <a href=\"https://www.elections.il.gov/Main/FAQ.aspx#VoterRegistration\">Illinois State Board of Elections</a> website.",
      "byMailInstructions": "You must be at least 17 years old and you must be 18 on or before the next General or Consolidated Election to submit a voter registration application by mail in Illinois. When submitting your application by mail in Illinois, you are required to provide your Illinois Driver’s License number, Illinois Secretary of State ID card number, or the last four digits of your Social Security number, if you have one. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.<br><br>If you are registering to vote for the first time in your jurisdiction and you do not include an ID number on your mail-in application, you must submit with your form a copy of ONE of the following forms of ID: current and valid photo identification; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address<br><br>If you do not include a copy of your ID, you will be required to provide identification when voting for the first time.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "IN",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Indiana online voter registration system, you are required to provide ONE of the following: Indiana driver's license number; Indiana State Identification Card number<br><br>If you don’t have an Indiana-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Indiana: county voter registration office; Bureau of Motor Vehicles (BMV) license branch when conducting a credential transaction<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://www.in.gov/sos/elections/voter-information/register-to-vote/\">Indiana Election Division</a> website.<br><br>If you are registering for the first time, your application must include your Indiana driver's license number, Indiana state ID number, or the last four digits of your Social Security number. If you do not include an ID number or if the name and address you use when registering does not match an existing Indiana record, you will need to provide proof of residency. Your proof of residency document must include the current name and address you use to register to vote. Acceptable forms include: Indiana driver's license or Indiana-issued ID card; any current and valid photo ID issued by the US government, State of Indiana, or Native American Indian tribe or band recognized by the United States government; current utility bill; bank statement; government check; paycheck; other government document",
      "byMailInstructions": "When submitting your application by mail in Indiana, you are required to provide your Indiana driver’s license number or Indiana Bureau of Motor Vehicles ID Card number. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.<br><br><br>If you do not include an ID number on your registration application or your name or address does not match the information on your existing Indiana record, you must provide a proof of residency document when registering for the first time. You can include a copy of an acceptable document with your application or you may submit an acceptable document to your local election office at any time on or before Election Day. Your proof of residency document must include the current name and address you used to register to vote. Acceptable forms of proof of residency include: Indiana driver's license or Indiana-issued ID card; any current and valid photo ID issued by the US government, State of Indiana, or Native American Indian tribe or band recognized by the United States government; current utility bill; bank statement; government check; paycheck; other government document",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general or municipal election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "KS",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Kansas online voter registration system, you are required to provide ONE of the following ID numbers: Kansas driver's license; Kansas non-driver's identification card<br><br>If you don’t have a Kansas-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county election office in Kansas.",
      "byMailInstructions": "When submitting your application by mail in Kansas, you are required to provide your current Kansas driver’s license number or nondriver’s identification card number. If you do not have either, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, write “none” in the ID number box.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-08-04",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "KY",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Kentucky online voter registration system, you are required to provide your full Social Security number.<br><br>If you don’t have a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county clerk’s office in Kentucky.",
      "byMailInstructions": "When submitting your application by mail in Kentucky, you are required to provide your full Social Security number. <br><br>If you do not have a Social Security number, leave that field blank. You will not be denied the right to register to vote if you do not include your Social Security number.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "state": "LA",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Louisiana online voter registration system, you must be at least 17 years old. You are required to provide the four-digit audit code from your Louisiana driver's license or Louisiana special ID.<br><br>If you are at least 17 years old and don’t have a Louisiana driver's license or Louisiana special ID, you can still submit a voter registration application by mail or in person. If you are 16 years old, you can submit a voter registration application in person at the Registrar of Voters Office or at the Louisiana Office of Motor Vehicles.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Louisiana: Louisiana Office of Motor Vehicles; Registrar of Voters Office<br><br>If you are registering to vote in person at a parish Registrar of Voters Office, you are required to prove age, residency, and identity. <br><br>Acceptable forms include: Louisiana driver’s license or Louisiana special ID card; birth certificate; other documentation that reasonably and sufficiently establishes your identity, age, and residency<br><br>If you are at least 17 years old, you can also complete a voter registration application in person at any mandated site listed on the <a href=\"https://www.sos.la.gov/ElectionsAndVoting/RegisterToVote/Pages/default.aspx\">Louisiana Secretary of State’s</a> website. If you are registering at a mandated site, you only need to provide whatever proof of identification is required for services received that you have applied for at the public agency.",
      "byMailInstructions": "You must be at least 17 years old to submit a voter registration application by mail in Louisiana. When submitting your application by mail in Louisiana, you are required to provide the following ID numbers, if you have them: Louisiana driver’s license or special ID card number; last four digits of your Social Security number<br><br>If you do not have any of these numbers, you must include a copy of ONE of the following: current and valid photo identification; current utility bill, bank statement, government check, paycheck, or another government document",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "MA",
    "youthRegistration": {
      "url": "https://www.sec.state.ma.us/divisions/elections/voter-resources/registering-to-vote.htm",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To pre-register using the Massachusetts online voter registration system you must be at least 16 years old. You are required to provide ONE of the following ID numbers issued by the Massachusetts Registry of Motor Vehicle (RMV): Driver's License; Learner's Permit; State ID<br><br>If you don’t have a RMV-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person and pre-register if you are at least 16 years old and you visit any of the following public agencies in Massachusetts: local town clerk, election commission, and Board of Registrars office; Secretary of the Commonwealth Elections Division office or regional offices",
      "byMailInstructions": "When submitting your pre-registration application by mail in Massachusetts, you must be at least 16 years old. You are required to provide your current and valid Massachusetts Driver’s License number if you have one. If you have not been issued a Massachusetts Driver’s License, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, write “NONE” in the identification number box. <br><br>You are also required to provide a copy of identification if you are registering for the first time and submitting your application by mail. Acceptable forms of proof of residence include: current and valid photo ID; utility bill, bank statement, government check, paycheck, or other government document that shows your name and address<br><br>If you do not include a copy of identification with your voter registration application, you may need to show it the first time you vote.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "MD",
    "youthRegistration": {
      "url": "https://www.elections.maryland.gov/voter_registration/17_year_olds.html",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Maryland online voter registration system, you are required to provide the last four digits of your Social Security Number and ONE of the following: Maryland driver’s license number; Maryland state ID number",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Maryland: Maryland Motor Vehicle Administration (MVA) offices; local board of elections; Maryland public higher education institutions<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://elections.maryland.gov/voter_registration/index.html\">Maryland State Board of Elections</a> website.<br><br>If you are registering to vote in person, you are required to provide Proof of residence. Acceptable forms include: MVA-issued license, ID card, or change of address card; paycheck, bank statement, utility bill, or other government document with your name and address",
      "byMailInstructions": "When submitting your application by mail in Maryland, you are required to provide your Maryland driver’s license or state-issued ID card number. If you do not have a Maryland-issued ID, you must include the last four digits of your Social Security number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "ME",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Maine online voter registration system, you are required to provide at least ONE of the following: Maine driver’s license number; Maine state ID card number; last four digits of your Social Security number<br><br>If you don’t have a Maine driver’s license, Maine ID card, or Social Security number, you can still submit a voter registration application in person or by mail.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Maine: town office or city hall; Motor Vehicle branch office; most state and federal social service agencies. Contact the agency before you go to confirm they offer in-person registration.<br><br>If you are registering to vote for the first time in Maine, you are required to provide proof of identity that demonstrates residence in Maine.<br><br>Acceptable forms include: government document or credential with photo ID; government ID document/credential without photo; official document that shows your name and address; student photo ID from a state-approved public or private school or institute of higher education in Maine; Maine driver’s license or State ID card number; last four digits of Social Security number; <br><br>View the <a href=\"https://www.maine.gov/sos/elections-voting/state-of-maine-voter-guide\">State of Maine Voter Guide</a> for examples.",
      "byMailInstructions": "When submitting your application by mail in Maine, you are required to provide your Maine driver’s license or State ID number. If you do not have a Maine driver’s license or State ID, you are required to include the last four digits of your Social Security number. If you have not been issued any of these numbers, write \"NONE\" in the space for ID number. <br><br>If it is your first time registering to vote in Maine, you are also required to provide a copy of one of the following: Maine driver’s license; Maine State ID card; current utility bill, bank statement, or government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unavailable",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "MI",
    "youthRegistration": {
      "url": "https://www.michigan.gov/sos/elections/voting/first-time-voters",
      "formUrl": "https://www.michigan.gov/sos/-/media/Project/Websites/sos/Elections/Election-Forms/ED-121a-Michigan-Voter-Preregistration-Application-and-Change-of-Address-Form.pdf?rev=2a0413ce83e24577ab6bbe36f2c08df7&amp;hash=E53D1A3FBE546E4AACEE451E4EAD332A",
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Michigan online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following: Michigan driver’s license; Michigan state ID number <br><br>If you don’t have a Social Security number or Michigan-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Michigan: Secretary of State branch office; city, township, or county clerk’s office; any state agency that provides public assistance or services to people with disabilities",
      "byMailInstructions": "When submitting your application by mail in Michigan, you are required to provide your Michigan-issued driver’s license or state ID number. If you do not have a Michigan-issued ID, you must include the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. You must also include a copy of one of the following forms of identification when mailings this form to your county, city, or township clerk: current and valid photo identification (such as a driver’s license or state ID from any state); paycheck stub, utility bill, bank statement, or a government document that lists your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "MN",
    "youthRegistration": {
      "url": "https://www.sos.mn.gov/elections-voting/register-to-vote/",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Minnesota online voter registration system, you are required to provide your email address and ONE of the following: Minnesota driver’s license number; Minnesota identification card number; last four digits of your Social Security number<br><br>If you don’t have a Minnesota-issued ID or Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can register to vote in person at a Driver and Vehicle Services Office when applying for or renewing a Minnesota driver’s license or state ID. To register to vote, you must check the box on your driver’s license or state ID application. The Department of Public Safety (DPS) will review citizenship documentation and ensure you meet all other eligibility requirements before sending your information to the Minnesota Secretary of State’s office.",
      "byMailInstructions": "When submitting your application by mail in Minnesota, you are required to provide your Minnesota-issued driver’s license or Minnesota ID card number. If you do not have a Minnesota state-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "MO",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Missouri online voter registration system, you are required to use a tablet, mobile device, or another touchscreen device. This is because you will be required to provide a signature during the process. <br><br>If you don’t have a touchscreen device, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Missouri: County Clerk’s office; Department of Motor Vehicles office; any state agency providing service to the public",
      "byMailInstructions": "When submitting your application by mail in Missouri, you are required to provide your Missouri driver’s license number and the last four digits of your Social Security number. If you have not been issued either or both of these numbers, leave the corresponding box blank.<br><br>When submitting a registration application by mail and registering to vote for the first time, you can optionally provide a copy of ONE of the following forms of identification: current or valid photo ID; current utility bill, bank statement government check, paycheck, or other government document that shows your name and address; birth certificate; Native American tribal document; other proof of United States citizenship<br><br>You will be required to present a government-issued photo ID when you vote.",
      "eligibilityAge": "P17Y6M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "MS",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Mississippi: Circuit Clerk and Municipal Clerk’s office; Department of Public Safety when getting a driver’s license<br><br>You can also find a list of locations that provide voter registration applications on the <a href=\"https://www.sos.ms.gov/voter-id/register\">Mississippi Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Mississippi, you are required to provide ONE of the following ID numbers: Mississippi Driver’s License; last four digits of Social Security number<br><br>If you do not have a Mississippi Driver’s or Social Security number, you must include with your mail-in voter registration application a copy of ONE of the following forms of identification: current and valid photo ID; current utility bill, bank statement, government check, paycheck or other government document that shows your name and address in the county where you register",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "MT",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your county election office in Montana. You can also fill out and sign a registration form when you apply for or renew your driver’s license or Montana ID. <br><br>If you are registering to vote in person, you are required to provide an original version of ONE form of identification. Acceptable forms include: military ID card; tribal photo ID card; US passport; Montana concealed carry permit; photo ID with your name (includes school district and postsecondary education photo ID); current utility bill, bank statement, paycheck, government check, or other government document that shows your name and current address",
      "byMailInstructions": "When submitting your application by mail in Montana, you are required to provide your current Montana driver’s license number or Montana state ID card number. If you do not have either, you must provide the last four digits of your Social Security number. If you are unable to provide these ID numbers, check the box that indicates you do not have an ID number and include with your application a copy of ONE form of identification. Acceptable forms include: military ID card; tribal photo ID card; US passport; Montana concealed carry permit; photo ID with your name (includes school district and postsecondary education photo ID) AND current utility bill, bank statement, paycheck, government check, or other government document that shows your name and current address",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-06-02",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "NC",
    "youthRegistration": {
      "url": "https://www.ncsbe.gov/registering/who-can-register/preregistering-vote-when-you-are-16-or-17-years-old",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register online in North Carolina, you must be at least 17 years old. You must be an existing North Carolina Division of Motor Vehicles (NCDMV) customer and you will need your DMV-issued driver’s license or ID number and Social Security number.<br><br>If you don’t have a NCDMV-issued ID, you can still submit a voter registration application by mail or in person at your county election office.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in North Carolina: County Board of Elections; North Carolina Division of Motor Vehicles (NCDMV)<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://www.ncsbe.gov/registering/national-voter-registration-act-nvra\">North Carolina State Board of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in North Carolina, you are required to provide your valid North Carolina driver’s license or DMV ID number. If you do not have a North Carolina-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: current utility bill; bank statement; government check; paycheck; other government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "ND",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "notApplicable",
      "methods": null,
      "onlineInstructions": null,
      "inPersonInstructions": null,
      "byMailInstructions": null,
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": null,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "NE",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Nebraska online voter registration system, you are required to provide ONE of the following ID numbers: Nebraska driver’s license; Nebraska state-issued ID card<br><br>If you don’t have a Nebraska-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county election office or at the Department of Motor Vehicles (DMV) when applying for or renewing your driver's license in Nebraska.<br><br>You can also register in person at the following public agencies at the time of application, review, or change of address in connection with public programs: Department of Health and Human Services; State Department of Education",
      "byMailInstructions": "When submitting your application by mail in Nebraska, you are required to provide your Nebraska driver’s license or state ID number. If you do not have a Nebraska-issued ID, you are required to provide the last four digits of your Social Security number.<br><br>If you are registering to vote for the first time in Nebraska and you mail your registration application, you must provide a copy of proof of identity so that you avoid delays with your registration. Acceptable forms include: current and valid photo ID; utility bill, bank statement, government check, paycheck, or other government document that is dated within 60 days immediately before submitting your application and shows the same name and residence address on your voter registration form",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "NH",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your town hall in New Hampshire. <br><br>If you are registering in person, you are required to provide proof of your identity, age, citizenship, and domicile (home address) to register.<br><br>Acceptable forms of proof of identity and age include: driver’s license from any state; non-driver ID from any state<br><br>Acceptable forms of proof of citizenship include: birth certificate; US Passport/Passcard; naturalization document<br><br>You will also need to prove that your domicile (home) is in the town or ward where you intend to vote. You can find a full list of acceptable forms of proof of domicile on the <a href=\"https://www.sos.nh.gov/sites/g/files/ehbemt561/files/inline-documents/sonh/registering-to-vote-in-new-hampshire-february-2025_3.pdf\"> New Hampshire Secretary of State’s</a> website.",
      "byMailInstructions": "You can only submit a voter registration application by mail if you: will be absent from your town or city when the Supervisors of the Checklist meet to receive voter registration applications; are unable to vote in person because of a physical disability; cannot appear in person because of observance of a religious commitment; are a victim of domestic violence and have an active protective order; are confined to a penal institution awaiting trial or because of a misdemeanor conviction<br><br>Contact your <a href=\"https://app.sos.nh.gov/clerkinformation\">city clerk</a> to request an absentee (mail-in) voter registration application.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-09-08",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "NJ",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the New Jersey online voter registration system, you are required to provide your New Jersey Driver’s License number or non-driver ID card number issued by the New Jersey Motor Vehicle Commission (MVC). If you do not have a New Jersey-issued ID, you must provide your Social Security number AND use a device that allows you to sign on-screen or upload your signature.<br><br>If you don’t have any of the above, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can register to vote in person at a motor vehicle agency while applying for or renewing a driver’s license or non-driver ID card with the New Jersey Motor Vehicle Commission (MVC). The MVC will report the information to the New Jersey Division of Elections.",
      "byMailInstructions": "When submitting your application by mail in New Jersey, you are required to provide your New Jersey Driver’s License number or non-driver ID card number issued by the New Jersey Motor Vehicle Commission (MVC). If you do not have a New Jersey-issued ID, you must provide the last four digits of your Social Security Number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following with your application: current and valid photo ID; document with your name and current address<br><br>If you do not include a copy of acceptable ID with your application, you will need to verify your identity the first time you vote.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "NM",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the New Mexico online voter registration system, you are required to provide your Social Security number and ONE of the following ID numbers: New Mexico driver’s license; New Mexico state ID<br><br>If you don’t have a New Mexico-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in New Mexico: New Mexico Secretary of State’s office; County Clerk; Motor Vehicle Division (MVD)",
      "byMailInstructions": "When submitting your application by mail in New Mexico, you are required to provide your New Mexico driver's license number, state ID number, or the last four digits of your Social Security number.<br><br>If you are registering to vote for the first time in New Mexico and you mail your registration application, you must include a copy of proof of identity with your form or present ID when voting in person or absentee. Acceptable forms include: current and valid photo identification; current utility bill, bank statement, government check, paycheck, student identification card, or other government document that shows your name and current address (includes tribal ID)",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "state": "NV",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Nevada online voter registration system, you are required to provide: current and valid driver’s license or ID card issued by the Nevada DMV; last four digits of your Social Security number<br><br>If you don’t have a Nevada-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Nevada: Nevada Department of Motor Vehicles (DMV); County Clerk or Registrar of Voters Office; college campuses; various social service agencies<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://www.nvsos.gov/sos/elections/voters/registering-to-vote/national-voter-registration-act-nvra/nvra-voter-registration-agencies\">Nevada Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Nevada, you are required to provide your Nevada driver’s license or state ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. If you select this option, you will be contacted by your County Election Department for more information once your application is received.",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "NY",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the New York online voter registration system, you need a NY.Gov ID. If you have previously used NY.Gov with another agency, you may use the same login to access the Online Voter Registration portal. If you have not used NY.Gov, you will need to create an account.<br><br>You will be asked to provide your New York State-issued ID number. If you don’t have a New York State-issued ID, you can still submit a voter registration application online, but you will have to show ID the first time you vote. You can also submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in New York: County Board of Elections; Department of Motor Vehicles (DMV) when you apply for or renew your driver license or ID card; City Universities of New York (CUNY); State Universities of New York (SUNY)<br><br>You can find a full list of designated voter registration agencies on the <a href=\"https://elections.ny.gov/national-voter-registration-act-nvra#agency-based-voter-registration\">New York State Board of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in New York, you are required to provide your valid New York State driver's license, permit, or ID number. If you do not have a New York State-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "OH",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Ohio online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following ID numbers: Ohio driver’s license; Ohio identification card number<br><br>If you don’t have an Ohio-issued ID or Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Ohio: county board of elections; Ohio Bureau of Motor Vehicles (BMV); public libraries; public high schools or vocational schools<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://www.ohiosos.gov/elections/voters/register/\">Ohio Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Ohio, you are required to provide your Ohio driver’s license number or Ohio state ID number. If you do not have an Ohio-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, write “none” in the ID number box.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "state": "OK",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Oklahoma online voter registration system, you are required to provide your Oklahoma driver license or state ID number. You must also have a digital signature on file with Service Oklahoma to use the online voter registration system.<br><br>If you don't have an Oklahoma-issued ID or a digital signature on file with Service Oklahoma, you can still submit a voter registration application by mail.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Oklahoma: County Election Board office; tag agency when applying for, renewing, or updating your driver's license or state ID; select public assistance agencies when applying for, updating, or renewing services",
      "byMailInstructions": "When submitting your application by mail in Oklahoma, you are required to provide your Oklahoma driver’s license or state ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P17Y6M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "OR",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Oregon online voter registration system, you are required to provide ONE of the following: Oregon driver’s license or permit number; ID card number issued by the Oregon Driver and Motor Vehicle Services Division (DMV)<br><br>If you don’t have an Oregon-issued ID, you can still use the online voter registration application to generate a PDF form that you must print, sign, and return to your county elections office by mail or in person.",
      "inPersonInstructions": "If eligible, you will be automatically registered to vote when you apply for, renew, or replace an Oregon driver’s license, ID card, or permit at the DMV, unless you choose to opt-out. You can also complete a voter registration application in person at your county elections office.",
      "byMailInstructions": "When submitting your application by mail in Oregon, you are required to provide your valid Oregon driver's license, permit, or ID number. If you do not have an Oregon-issued ID, you must provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and include a copy of ONE of the following with your application: valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and address; proof of eligibility under the Uniformed and Overseas Citizens Absentee Voting Act (UOCAVA) or the Voting Accessibility for the Elderly and Handicapped Act (VAEH)",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unavailable",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "PA",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Pennsylvania online voter registration system, you are required to provide your Pennsylvania driver’s license number or PennDOT ID card number. If you do not have a Pennsylvania-issued ID, you are required to provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number. To complete the online voter registration application without a PennDOT ID number, you must upload a digital image of your signature. You can also request and sign a signature form from the Department of State or print and sign a voter registration application. Both the signature form and the printed registration application must be returned to your county elections office by mail or in person. <br><br>If you don’t have an ID number and do not upload an image of your signature, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Pennsylvania: county voter registration office; Pennsylvania Department of Transportation (PennDOT) photo or driver’s license center when obtaining or updating your driver's license<br><br>You can also find a list of locations that provide voter registration services at <a href=\"https://www.pa.gov/services/vote/register-to-vote.html\">vote.pa.gov</a>.",
      "byMailInstructions": "When submitting your application by mail in Pennsylvania, you are required to provide your Pennsylvania driver’s license number or PennDOT ID card number. If you do not have a Pennsylvania-issued ID, you are required to provide the last four digits of your Social Security number. <br><br>If you have not been issued any of these numbers, indicate that you do not have an ID number.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next primary, special, municipal, or general election",
      "eligibilityByElection": {
        "date": "2026-05-19",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "RI",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Rhode Island online voter registration system, you are required to provide your Rhode Island DMV-issued driver’s license or State ID number. If you don’t have a Rhode Island-issued ID, you can still submit a voter registration form by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration form in person at any Rhode Island Division of Motor Vehicles (DMV) office while completing DMV forms. If you are eligible to register to vote, you are automatically registered to vote while completing DMV forms unless you opt out.<br><br>You can also download a voter registration form and bring the completed form to your local board of canvassers.",
      "byMailInstructions": "When submitting your form by mail in Rhode Island, you are required to provide your Rhode Island DMV issued driver’s license or State ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "SC",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the South Carolina online voter registration system, you are required to provide your Social Security number and ONE of the following ID numbers: South Carolina driver’s license; South Carolina Department of Motor Vehicles (SCDMV) ID<br><br>If you don’t have a South Carolina-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in South Carolina: county board of voter registration; Department of Motor Vehicles<br><br>You can also find a list of locations that provide voter registration services at <a href=\"https://scvotes.gov/voters/register-to-vote/\">scvotes.gov</a>.",
      "byMailInstructions": "When submitting your application by mail in South Carolina, you are required to provide at least the last four digits of your Social Security number and a copy of ONE of the following forms of ID: current valid photo ID; current utility bill, bank statement, paycheck or other government document that shows your name and address in the county where you register to vote<br> <br>If you do not provide a copy of proof of ID, you will be required to provide it before voting.<br><br>You are exempt from the ID requirement when submitting a voter registration application by mail if you: are 65 years old or older; have a disability; are a member of the US Uniformed Services or Merchant Marines or their family; are a US citizens residing outside the US",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "SD",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in South Dakota: county auditor's office; driver's license station<br><br>You can find a list of locations that provide voter registration services on the <a href=\"https://sdsos.gov/elections-voting/voting/register-to-vote/default.aspx\">South Dakota Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in South Dakota, you are required to provide your South Dakota Driver License number or South Dakota Non-Driver ID number. If you do not have a South Dakota-issued ID, you are required to provide the last four digits of your Social Security number.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "TN",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Tennessee online voter registration system, you need your Social Security number and ONE of the following ID numbers: Tennessee driver's license; Tennessee Department of Safety and Homeland Security ID<br><br>If you submit a voter registration application online, you must vote in person the first time after registering.<br><br>If you don’t have a Tennessee-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can obtain a voter registration application in person at any of the following public agencies in Tennessee: County Election Commission; County Clerk; Public Libraries; Department of Safety (motor vehicles division)<br><br>You can find a list of locations that provide voter registration services and applications on the <a href=\"https://sos.tn.gov/elections/guides/how-to-register-to-vote\">Tennessee Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Tennessee, you are required to provide your Social Security number. If you submit a voter registration application by mail, you must vote in person the first time after registering.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-08-06",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "TX",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your county’s Voter Registrar office in Texas.",
      "byMailInstructions": "When submitting your application by mail in Texas, you are required to provide your Texas driver’s license number or Texas personal identification (ID) number, if you have one.<br><br>If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P17Y10M",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "UT",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Utah online voter registration system, you are required to provide ONE of the following: valid Utah driver license number; valid Utah ID number<br><br>Your address must also match the address on file with the Driver License Division. If your driver license address is not current, you must update your address with the Driver License Division before submitting your online voter registration.<br><br>If you don't have a Utah-issued ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your county clerk’s office in Utah.",
      "byMailInstructions": "When submitting your application by mail in Utah, you are required to provide your Utah driver license or Utah ID number if you have one. If you have not been issued one of these ID numbers, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "VA",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Virginia online voter registration system, you are required to provide: Virginia driver’s license or state ID number; full Social Security number<br><br>If you don't have a Virginia-issued ID or Social Security number, you can submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Virginia: local voter registration office; Department of Motor Vehicles (DMV) offices; Virginia Department of Elections office<br><br>You can find a list of locations that provide voter registration applications on the <a href=\"https://www.elections.virginia.gov/registration/how-to-register/\">Virginia Department of Elections</a> website.",
      "byMailInstructions": "When submitting your application by mail in Virginia, you are required to provide your full Social Security number if you have one. If you have not been issued a Social Security number, check the box that indicates you do not have a Social Security number.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "VT",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Vermont online voter registration system, you are required to provide ONE of the following ID numbers: Vermont driver’s license; Vermont permit; Vermont ID<br><br>If you do not have a Vermont-issued ID, you must provide the last four digits of your Social Security number.<br><br>If you are registering to vote in Vermont for the first time, you must include a copy of ONE form of ID. Acceptable forms include: valid driver’s license; valid passport; current utility bill; current bank statement; another government document containing your residential address<br><br>If you don’t have a Vermont-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your town clerk’s office in Vermont.",
      "byMailInstructions": "When submitting your application by mail in Vermont, you are required to provide your Vermont driver’s license number or Vermont personal ID (PID) number. If you do not have a Vermont-issued ID, you are required to provide the last four digits of your Social Security number. <br><br>If you are registering in Vermont for the first time, you must complete the Voter’s Oath. If you do not take oaths, you may take it as an affirmation.<br><br>If you are registering to vote in Vermont for the first time, you must include a copy of ONE form of ID with your name and current residential address. Acceptable forms include: current and valid photo ID; bank statement; utility bill; government document<br><br>If you do not have a Vermont-issued ID or Social Security number, contact the <a href=\"https://sos.vermont.gov/elections/about/\">Vermont State Election Division</a>.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "state": "WA",
    "youthRegistration": {
      "url": "https://www.sos.wa.gov/elections/voters/voter-eligibility-resources/future-voter-program",
      "formUrl": null,
      "supported": "byAge",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Washington online voter registration system, you are required to provide your Washington driver license number, Washington permit number, Washington state ID number, or the last 4 digits of your Social Security number.<br><br>If you don't have a Washington-issued ID, you can still submit a voter registration application by mail or in person with an alternate ID.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in Washington: County Elections Offices; Department of Licensing when you get your driver's license, permit, or ID<br><br>You can also register at your school's Temperance and Good Citizenship Day event in January.",
      "byMailInstructions": "When submitting your application by mail in Washington, you are required to provide your Washington driver license, permit, or ID number or the last four digits of your Social Security number. If you have not been issued any of these numbers, you can leave that field blank. After you submit your application, your local election office will reach out to give you instructions about using an alternate ID to complete the voter registration process.",
      "eligibilityAge": "P16Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": null,
      "eligibilityByElection": {
        "date": null,
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": null
      }
    }
  },
  {
    "state": "WI",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the Wisconsin online voter registration system, you are required to provide a Wisconsin driver license or Wisconsin state ID number. To complete a voter registration application online, your name, date of birth, and ID number must match what is on file with the Department of Motor Vehicles (DMV).<br><br>If you do not have a Wisconsin-issued ID, or if your voter registration address does not match the address on your ID, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at your municipal clerk’s office in Wisconsin. <br><br>You are required to provide your valid and unexpired Wisconsin driver license or Wisconsin state ID number and expiration date. If you have not been issued a Wisconsin ID, or if you have an expired, canceled, suspended, or revoked Wisconsin-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, you will be able to indicate that.<br><br>If you are registering to vote in person, you are also required to provide proof of residence. Visit the <a href=\"https://elections.wi.gov/Register#230548828-3947500893\">Wisconsin Elections Commission</a> website to find more information and a full list of acceptable forms of proof of residence.",
      "byMailInstructions": "When submitting your application by mail in Wisconsin, you are required to provide your valid and unexpired Wisconsin driver license or Wisconsin state ID number and the expiration date. If you have not been issued a Wisconsin ID, or if you have an expired, canceled, suspended, or revoked Wisconsin-issued ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, check the box that indicates you do not have an ID number.<br><br>You must also provide proof of residence when registering to vote. If you submit your application by mail, you must include a copy of proof of residence or submit proof of residence in an electronic format. Visit the <a href=\"https://elections.wi.gov/Register#230548828-3947500893\">Wisconsin Elections Commission</a> website to find more information and a full list of acceptable forms of proof of residence.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next election",
      "eligibilityByElection": {
        "date": "2026-04-07",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": true
      }
    }
  },
  {
    "state": "WV",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "online,by-mail,in-person",
      "onlineInstructions": "To register using the West Virginia online voter registration system, you are required to provide the last four digits of your Social Security number and ONE of the following: West Virginia driver’s license number; West Virginia ID card number<br><br>If you don’t have a West Virginia-issued ID or a Social Security number, you can still submit a voter registration application by mail or in person.",
      "inPersonInstructions": "You can complete a voter registration application in person at any of the following public agencies in West Virginia: County Clerk; Division of Motor Vehicles (DMV)<br><br>You can find a full list of in-person voter registration locations on the <a href=\"https://sos.wv.gov/elections/Pages/FAQs.aspx\">West Virginia Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in West Virginia, you are required to provide your West Virginia driver’s license or West Virginia Division of Motor Vehicles (DMV) ID number. If you have not been issued a West Virginia ID, you must provide the last four digits of your Social Security number. If you have not been issued any of these numbers, write “none” in the ID number box.<br><br>If you are registering to vote for the first time in West Virginia or in your county and you have not cast a vote in a federal election in West Virginia, you must submit with your form a copy of a current and valid ID or show it the first time you vote. Acceptable forms include: current and valid photo ID; current utility bill, bank statement, government check, paycheck, or other government document that shows your name and current residence address",
      "eligibilityAge": "P17Y",
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": true,
        "futureLocalElectionApplicable": false
      }
    }
  },
  {
    "state": "WY",
    "youthRegistration": {
      "url": null,
      "formUrl": null,
      "supported": "byElection",
      "methods": "by-mail,in-person",
      "onlineInstructions": null,
      "inPersonInstructions": "You can complete a voter registration application in person at your county clerk’s office and certain public agencies in your county in Wyoming. You can look up your <a href=\"https://sos.wyo.gov/Elections/Docs/WYCountyClerks.pdf\">county clerk’s</a> website and find locations that offer in-person voter registration services.<br><br>If you are registering to vote in person, you must provide proof of identity, residence, and citizenship. <br><br>You can find a full list of acceptable forms of proof of identity, residence, and citizenship on the <a href=\"https://sos.wyo.gov/elections/state/registeringtovote.aspx\">Wyoming Secretary of State’s</a> website.",
      "byMailInstructions": "When submitting your application by mail in Wyoming, you are required to provide your Wyoming driver’s license number and provide proof of identity, residence, and citizenship. Your form must also be notarized before mailing.<br><br>Acceptable forms of proof of identity AND residence include: Wyoming driver’s license; United States passport; tribal ID card issued by a federally recognized tribe<br><br><br>If you have not been issued one of these forms of ID, you may provide your Wyoming driver's license number or the last 4 digits of your Social Security number, along with additional proof of identity. You can find a full list of acceptable forms of proof of identity on the <a href=\"https://sos.wyo.gov/elections/state/registeringtovote.aspx\">Wyoming Secretary of State’s</a> website.<br><br>If you have not been issued any of these numbers, check the box that indicates you do not have an ID number and contact your county clerk.<br><br>You must provide proof of citizenship when you register to vote. Your proof of citizenship cannot contain any indication that you are not a US citizen. Acceptable forms include but are not limited to: Wyoming driver's license or ID card; US passport; Valid driver's license or ID card issued by any other state that is consistent with the Real ID Act<br><br>You can find a full list of acceptable forms of proof of citizenship on the <a href=\"https://sos.wyo.gov/elections/state/registeringtovote.aspx\">Wyoming Secretary of State’s</a> website.",
      "eligibilityAge": null,
      "statusAvailability": "Unknown",
      "eligibilityByElectionType": "next general election",
      "eligibilityByElection": {
        "date": "2026-11-03",
        "primaryVotingSupported": false,
        "futureLocalElectionApplicable": false
      }
    }
  }
]